/*var test = ["a", "b", "c"]
test.map((value, index) => {
    console.log(value, index)
})*/
const json_obj = {
    "YouTube": "https://youtube.com/channel/UCFYwv1RCjVveguPeM6elqpg",
    "Twitter": "https://twitter.com/WeArabGamers",
    "Discord": "https://discord.gg/sPfG5RR6A4"
}

var dat = []

for (var n in json_obj){
    dat.push({name: n, value: json_obj[name]})
}


const newCmd = new SlashCommandBuilder()
    .setName('accounts')
    .setDescription('Send a link of an account for Arab gamers')

    .addStringOption(option => option
        .setName('platform')
        .setDescription('The plaftorm')
        .setRequired(true)
        .addChoices(...dat)
    );


module.exports = {
    data: newCmd
};

return;
const qrcode = require('qrcode-terminal');
const {Client, LocalAuth} = require('whatsapp-web.js');

const client = new Client({
    puppeteer: {
        args: ['--no-sandbox', '--disable-setuid-sandbox']
    },
    authStrategy: new LocalAuth()
});
// Import all the bots
const {NewsBot, HelpBot} = require('./Bots/index.js');

// create new Instance of each bot
const newsBot = new NewsBot("News Bot");
const helpBot = new HelpBot("#والتر الأبيض", "#والتر", "966561815334-1612040974@g.us");
helpBot.AddCommand("#والتر الأبيض", `「الــبـــــوت 🤖 والتر الابيض」
─━─━─━∞◆∞━─━─

•| قـائـمـة الاوامـر :


أرسـل「 #والتر القوانين」
📃 ┊لعرض النظام والقوانين في قروبنا


أرسـل「 #والتر توصيات」
⚜ ┊لعرض التوصيات سواء افلام او مسلسلات او سلاسل افلام أخرى
هاي احذفها اذا صعبه 

أرسل「#والتر مشاهدة」
📺 ┊لعرض المواقع العربية التي يمكنك منها مشاهدة الافلام والمسلسلات مترجمة
هنا بحط قائمه في المواقع 

أرسل「#والتر تلقرام」
🔱  | لعرض قائمة مسلسلات الخاصة بتلقرام وتم تنزيلها بجميع مواسمها


─━─━─━∞◆∞━─━─`);
helpBot.AddCommand("#والتر", `「الــبـــــوت 🤖 والتر الابيض」
─━─━─━∞◆∞━─━─

•| قـائـمـة الاوامـر :


أرسـل「 #والتر القوانين」
📃 ┊لعرض النظام والقوانين في قروبنا


أرسـل「 #والتر توصيات」
⚜ ┊لعرض التوصيات سواء افلام او مسلسلات او سلاسل افلام أخرى
هاي احذفها اذا صعبه 

أرسل「#والتر مشاهدة」
📺 ┊لعرض المواقع العربية التي يمكنك منها مشاهدة الافلام والمسلسلات مترجمة
هنا بحط قائمه في المواقع 

أرسل「#والتر تلقرام」
🔱  | لعرض قائمة مسلسلات الخاصة بتلقرام وتم تنزيلها بجميع مواسمها


─━─━─━∞◆∞━─━─`);
helpBot.AddCommand("مشاهدة", `🔆مواقع مُشاهدة وتحميل أفلام ومسلسلات🔆 : 

1- fushaar.com

2 - egy.best

3- egybest.co

4 - movs4u.tv

5 - akoam.com

6-  movizland.com

7-  cimaclub.com

8-  Cima4u.tv

9 -  mycima.tv  

10 -  imovie-time.co

11 - https://www.faselhd.live/

"🔆مشاهدة ممتعة🔆"  🖤🎥`);
helpBot.AddCommand("مشاهده", `🔆مواقع مُشاهدة وتحميل أفلام ومسلسلات🔆 : 

1- fushaar.com

2 - egy.best

3- egybest.co

4 - movs4u.tv

5 - akoam.com

6-  movizland.com

7-  cimaclub.com

8-  Cima4u.tv

9 -  mycima.tv  

10 -  imovie-time.co

11 - https://www.faselhd.live/

"🔆مشاهدة ممتعة🔆"  🖤🎥`);
helpBot.AddCommand("قوانين", `الإنذار
 حذف أكثر من 3 رسائل بدون سبب.
السبام (4 رسائل بدون فائدة او 3 ملصقات) متتالية.
التحدث عن المعلومات الشخصية (الاسم،العمر،البلد،الخ).
ارسال مقطع أو صورة خارج الافلام او المسلسلات.
التحدث خارج محتوى الافلام او المسلسلات.
ارسال إحدى الوسائط اثناء المسابقة (مقطع،صورة،GIF).
الاعتراض على قرار مشرف في الفرع.
أخذ دور مشرف أو الكذب على احد المشرفين.
ارسال 10 صور أو أكثر دفعة واحدة.
الضحكات الطويلة (التي تزيد عن 10 أسطر).
إزعاج الأعضاء والتعرض لهم.

الإنذارين
تشفير الرسائل.
التحدث عن الدين و السياسة والطوائف.
سرقة مشاركة شخص في الفرع او خارجه.
الارسال او التحدث عن رواية او كوميك دون وضع تنبيه.

المؤبد
إرسال صور شخصية لك أو لغيرك.
السب و الشتم الجارح.
التهديد و الابتزاز.
النشر أو التحدث عن قروبات أخرى بأي شكل من الأشكال.
الاحتكاك بالجنس الآخر بأي شكل من الأشكال.`);
helpBot.AddCommand("تلقرام", `⚠️قائمة المسلسلات الخاصة بتلقرام وتم تنزيلها بجميع المواسم..🔥👇
        And Then There Were None
https://t.me/joinchat/SWHQL0_ft3M0QLg7

11.22.63
https://t.me/joinchat/AAAAAFc3hhXiDlAb2JiGPA

Barry
https://t.me/joinchat/AAAAAFceXOyjd5KxKxMViQ

Banshee
https://t.me/joinchat/AAAAAEl0jMpm5sYyN_6P7w

Band Of Brothers
https://t.me/joinchat/VMJT_JxhM0RCsXej

Boardwalk Empire
https://t.me/joinchat/UjEEorK2TIg86d4E

Black Sails
https://t.me/joinchat/T7Hpb5Ni1qSGaChL

Better Call Saul
https://t.me/joinchat/THE5aOTQeqgdogW-

Brooklyn Nine Nine
https://t.me/joinchat/AAAAAEoohPhQt2Mjd0dXzg

Breaking Bad 
https://t.me/joinchat/AAAAAEmwajZV8pDprR5nzg

Bodyguard
https://t.me/joinchat/VphgvLn9ocmhaDoR

Deadwood
https://t.me/joinchat/SsjvHXzoWQIGO7NT

Dark
https://t.me/joinchat/AAAAAFKrWX0sZ7BqyYOt5w

Chernobyl
https://t.me/joinchat/AAAAAEg5feMVDsR3VtLGlA

Friends
https://t.me/joinchat/BmkT_TBQCO5iNjFk

Fargo
https://t.me/joinchat/UPqowfARqqpubuTc

Dexter
https://t.me/joinchat/AAAAAFfULZbKxTNDr8sWFA

Game Of Thrones
https://t.me/joinchat/DCohRsTIAI9iYmM8

Hannibal
https://t.me/joinchat/Rf1G5Qyscz0-kV6b

Hell On Wheels
https://t.me/joinchat/AAAAAExTCx3BmpVY-H0-YQ

His Dark Materials
https://t.me/joinchat/U8hRLvvFUlpiGZ3O

House
https://t.me/joinchat/R-yFyGDR67TKn16f

Justified
https://t.me/joinchat/AAAAAFbHuN4gdQ9MkyAwIQ

Kingdom
https://t.me/joinchat/AAAAAFGF6om-B5-lTn9qig

Legion
https://t.me/joinchat/AAAAAEvYpukczRUxApee5A

Loki
https://t.me/joinchat/mH59ie3YDJhhYWU0

Lost
https://t.me/joinchat/TYB_SKDFax_vYty6

Luther
https://t.me/joinchat/T3s4ZxUHKOfsmBR5

Mindhunter
https://t.me/joinchat/UuDKcJMw1GQjF_sL

MadMen
https://t.me/madmenseries

Daredevil
https://t.me/joinchat/AAAAAEaCvVHJxTXaDilcUg

The Punisher
https://t.me/joinchat/AAAAAEyEb4ycurNpHQ8zsA

Mr inbetween
https://t.me/joinchat/AAAAAFQmLfoSbpf2cS3_9w

Mr. Robot
https://t.me/joinchat/SBFEsMnNYtTPd3uz

Outlander
https://t.me/joinchat/AAAAAFELi-TLMODDNmpXkw

O.Z
https://t.me/joinchat/SaPRNbd24yd1Adqd

Ozark
https://t.me/joinchat/VbpbYzBIRaMTrQ8F

Peaky Blinders
https://t.me/joinchat/AAAAAE97RY

Person Of Interest
https://t.me/joinchat/AAAAAEbGvuA2IiNBfq-MvQ

Ray Donovan
https://t.me/joinchat/AAAAAFBXQiqj9ZkcZKHRJg

Rectify
https://t.me/joinchat/AAAAAFTwGwmbu5RaqS7Ebg

Sherlock
https://t.me/joinchat/AAAAAEdhcoQInXtw72Uz7A

Sons Of Anarchy
https://t.me/joinchat/UfPjudxeZcGDh-jX

Suits
https://t.me/joinchat/Tqn_7cIjylXafyvB

Taboo
https://t.me/joinchat/V97dQgwYn0btIjbl

Ted Lasso
https://t.me/joinchat/RVKWld6FLkMxZDM0

THE100
https://t.me/The_100_o

The Americans
https://t.me/joinchat/AAAAAFScyeJVy3R596pS3A

The Boys
https://t.me/joinchat/WUwugsjjGZ3nusNv

The Great Train Robbery
https://t.me/joinchat/AAAAAFZ1qsg5D5xtn3r7KQ

The Last Kingdom
https://t.me/joinchat/AAAAAFhlXEdLRy_LbJVy8w

The Leftovers
https://t.me/joinchat/STp6oDWEE9vrwQee

The Night Of
https://t.me/joinchat/TjTD2wCRMjDPkdJI

The Office
https://t.me/joinchat/TOMgKeifMfj-SWIa

The Shield
https://t.me/joinchat/AAAAAESjSaciG0B7rqEIag

The Sopranos
https://t.me/joinchat/Slm_YcrRdQJWcGRk

The Walking Dead
https://t.me/joinchat/AAAAAEdByLoeYsr6yLBHdA

The Wire
https://t.me/joinchat/S90FGeNX3zSvq8CT

True Detective
https://t.me/joinchat/TrOJYAJp1M8k3cZe

Vikings
https://t.me/joinchat/AAAAAFKSzV5vOinn6qk1Nw

WandaVision
https://t.me/joinchat/R9yTFGbXP3w0xgUo

Westworld
https://t.me/joinchat/WKPFlBCJFFSaHunE

Harper's Island
https://t.me/shortseries/1318`);

helpBot.AddCommand(
    "توصيات",
    `سيعرض لك والتر قائمة بها عدّة خيارات وخانات...
قم باختيار ما تريده منه…
لعرض القائمة قم بكتابة 1#  او على حسب الرقم الذي تريده  

ستظهر القائمة بعد ثلاث ثواني`,
    false,
    true,
    [],
    [
        {
            "command": "#1",
            "message": `ترتيب افلام مارفل حسب الترتيب الزمني 🔥🕷

• المرحلة الأولى 

1- Iron man

2- The Incredible Hulk

3- Iron man 2

4- Thor

5- Captain America: the first avenger 

6- The Avengers 

• المرحلة الثانية

7- Iron man 3

8- Thor: The Dark World 

9- Captain America: the winter soldier 

10- Guardians of the Galaxy 

11- Avengers : Age of Ultron

12- Ant-Man

• المرحلة الثالثة

13- Captain America: Civil War 

14- Doctor Strange

15- Guardians of the Galaxy VOL.2

16- Spider-Man: Homecoming 

17- Thor: Ragnarok

18- Black Panther

19- Avengers : Infinity War

20- Ant-Man WASP

21- Captain Marvel 

22- Avengers : End Game

23- Spider-Man: Far from Home 

• المرحلة الرابعة

24- WandaVision ˢᵉʳᶦᵉˢ

25- The Falcon and The Winter Soldier ˢᵉʳᶦᵉˢ

26- LOKI ˢᵉʳᶦᵉˢ

27- Black Widow

28- WHAT IF..? ˢᵉʳᶦᵉˢ

29- Shang-Chi and The Legend of The Ten Rings

30- Eternals

31- Hawkeye ˢᵉʳᶦᵉˢ 

32- Spider-Man: No Way Home 

33- Moon Knight ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ᴹᵃʳᶜʰ ³⁰ ²⁰²²

34- Doctor Strange in the madness of the multiverse ˢᵒᵒⁿ ᴹᵃʸ ⁶ ²⁰²² 

35- Ms. Marvel ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ²⁰²²

36- Thor: Love and Thunder ˢᵒᵒⁿ ᴶᵘˡʸ ²⁰²²

37- She-Hulk ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ²⁰²²

38- Black Panther: Wakanda Forever ˢᵒᵒⁿ ²⁰²² 

39- Im Groot ²⁰²²`
        },
        {
            "command": "#2",
            "message": `ترتيب افلام Star Wars ⭐⚔️

1- A New Hope (1977)

2- The Empire Strikes Back (1980)

3- Return of the Jedi (1983)

4- The Phantom Menace (1999)

5- Attack of the Clones (2002)

6- Revenge of the Sith (2005)

7- The Force Awakens (2015)

8- Rogue One (2016)

9- The Last Jedi (2017)

10- Star Wars Solo (2018)

11- Star Wars: The Rise of Skywalker (2019)

12- The Mandalorian ˢᵉʳᶦᵉˢ

13- Boba Fett ˢᵉʳᶦᵉˢ`
        },
        {
            "command": "#3",
            "message": `ترتيب افلام عالم The Lord of The Rings

1-The Lord of The Rings: The Fellowship of The Ring (2001)

2-The Lord of The Rings: The Two Towers (2002)

3-The Lord of The Rings: The Return of The king (2003)

بعدها نرجع للماضي لمشاهدة ثلاثية اخرى لقصة اخرى في نفس العالم

4-The Hobbit: An Unexpected Journey (2012)

5-The Hobbit: The Desolation of Smaug (2013)

6-The Hobbit: The Battle of The Five Armies (2014)

مسلسل مشتق من السلسلة احداثه قبل الافلام 
The Lord of The Rings series ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ`
        },
        {
            "command": "#4",
            "message": `ترتيب افلام Dc حسب الترتيب الزمني⚡️🦇

Man of Steel (2013)

Batman v Superman: Dawn of Justice (2016)

Suicide Squad (2016)

Wonder Woman (2017)

Zack Snyder’s Justice League (2021)

Aquaman (2018)

Shazam! (2019)

Birds of Prey: and the Fantabulous Emancipation of One Harley Quinn (2020)

Wonder Woman 1984 (2021) 

The Suicide Squad (2021) 

Peacemaker (2022) ˢᵉʳᶦᵉˢ

The Batman (2022)

Black Adam (2022) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

Shazam! Fury of the Gods (2022) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

Aquaman and the Lost Kingdom (2023) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

The Flash (2023) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ`
        },
        {
            "command": "#5",
            "message": `ترتيب افلام X-men حست الترتيب الزمني 🌪💥

1- X-MEN (2000)

2- X-MEN2 (2003)

3- X-Men: The Last Stand (2006)

4- X-Men Origins: Wolverine (2009)

5- X-Men: First Class (2011)

6- The Wolverine (2013)

7- X-Men: Days of Future Past (2014)

8- Deadpool (2016)

9- X-Men: Apocalypse (2016)

10- Logan (2017)

11- Deadpool 2 (2018)

12- Dark Phoenix (2019)`
        },
        {
            "command": "#6",
            "message": `ترتيب أفلام Harry Potter🧹


1 - Harry Potter and the Sorcerer's Stone (2001)

2 - Harry Potter and the Chamber of Secrets (2002)

3 - Harry Potter and the Prisoner of Azkaban (2004)

4 - Harry Potter and the Goblet of Fire (2005)

5 - Harry Potter and the Order of Phoenix (2007)

6 - Harry Potter and the Half-Blood Prince (2009)

7 - Harry Potter and the Deathly Hallows  - Part 1 (2010)

8 - Harry Potter and the Deathly Hallows  - Part 2 (2011)

بعدها نرا سلسلة افلام اخرى لم تنتهي في نفس عالم السحرة في الماضي مكونة من خمسة اجزاء نزل منها ٢ والجزء الثالث قادم الى السينما في سنة 2022
1 - Fantastic Beasts and Where to Find Them (2016)
2 - Fantastic Beasts: The Crimes of Grindelwald (2018)
3 - Fantastic Beasts: The Secrets of Dumbledore (2022) ˢᵒᵒⁿ`
        },
        {
            "command": "#7",
            "message": `قائمة افلام خيال علمي 🎆:

-Inception (2010)

القصة : كوب (ليوناردو دي كابريو) هو عميل من طراز خاص جدًا ومستوى رفيع للغاية، في الواقع هو متسلل أحلام! يقوم بتجنيده رجل أعمال فاحش الثراء يدعى (سايتو) كي يقوم بالتسلل إلى عقل أحد منافسيه يدعى (روبرت فيشر) بمساعدة جهاز خاص، بزرع فكرة داخل عقل الرجل تبدو وكأنها تأتي من داخله هو نفسه، وليست من الخارج. الفكرة هي أن يفكك الرجل شركات أبيه التي سيورثها عنه.

النوع : اكشن - مغامرة - خيال علمي
التصنيف : PG-13
المدة : 2:28:09
التقيم : IMDb 8.8

-Interstellar (2014)

القصة : تنتشر الأتربة في بقاع اﻷرض، والأمراض التي تضرب الموارد الطبيعية، ويصبح الجنس البشري معرض للفناء؛ بسبب نقص الطعام وانتشار الأوبئة، ولذلك يسعى مجموعة من المستكشفين بقيادة الطيار (كوبر) إلى السفر في رحلة فضائية مجهولة من خلال الثقب الدودي من أجل البحث عن موطن وكوكب آخر يصلح للحياة من أجل إنقاذ البشرية.

النوع : مغامرة - دراما - خيال علمي
التصنيف : PG-13
المدة : 2:49:04
التقيم : IMDb 8.7

-The Matrix (1999)

القصة : يحاول مبرمج الكمبيوتر توماس أندرسون الذي يعمل تحت اسم مستعار (نيو) كقرصان حواسيب، وفي عالم الانترنت يحاول معرفة ما يحدث داخل عالم ماتريكس، فينضم إلى المجموعة بعد تناوله حبة حمراء تحرره وتعزله عن عالمه ويكتشف نيو أنه يعيش في العام 2199 تقريبًا، حيث أن هناك حرب بدأت بين الآلات وبين الجنس البشري.

النوع : اكشن - خيال علمي 
التصنيف : R 
المدة : 2:16:19 
التقيم : IMDb 8.6

-Jurassic Park ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : رجل أعمال عجوز ثري للغاية يدعى جون هاموند يحلم بإنشاء حديقه للحيوانات المنقرضة في أحد الجزر النائية في كوستاريكا، وبالفعل ينجح في استنساخ خمسة عشر فصيلة مختلفة من الديناصورات عن طريق استخلاص المادة الوراثية (الدنا) الخاصة بهم من البعوض المحفوظ داخل الكهرمان المتحجر.

النوع : اكشن - مغامرة - خيال علمي - اثارة
التصنيف : PG-13
المدة : 2:06:29
التقيم : IMDb 8.2`
        },
        {
            command: "#8",
            message: `قائمة افلام حربية 💣:

-Hacksaw Ridge (2016)

القصة : (ديزموند ت. دوس) مُسعف في الجيش الأمريكي خلال الحرب العالمية الثانية، والذي خدم في معركة (أوكيناوا) رافضًا قتل البشر تحت أي مسمى حتى خلال الحرب، كما أصبح أول مستنكف سلمي رافض للقتلتل في تاريخ العسكرية الأمريكية يتسلم ميدالية الكونجرس الشرفية، حيث شارك خلال الحرب العالمية الثانية دون حمل بندقية.

النوع : سيرة ذاتية - دراما - تاريخ - حرب
التصنيف : R
المدة : 2:19:20
التقيم :IMDb 8.1

-Saving Private Ryan (1998)

القصة : تدور أحداث الفلم أثناء الحرب العالمية الثانية في معركة (نورماندي) تحديدا ، حيث يكلف الرئيس الأمريكي كتيبة بقيادة الكابتن ميلر (توم هانكس) بالذهاب إلى قلب المعركة وراء خطوط العدو ، والبحث عن الجندي ريان (مات ديمون) ، والحفاظ على سلامته حتى يعود إلى والدته التي فقدت ثلاثة من أبنائها في الحرب الدائرة ، ولم يتبقَ لها سوى (ريان) . يخوض الكابتن (ميلر) العديد من المعارك أملا في الوصول إلى (ريان) .

النوع : دراما - حرب
التصنيف : R
المدة : 2:48:21
التقيم : IMDb 8.6

-Fury (2014)

القصة : في أبريل عام 1945 حينما كان الحلفاء يضعون لمساتهم الأخيرة على مسرح الأحداث الأوروبية، كان الخبير الحربي الرقيب واردادي (براد بيت) - وتحت قيادته طاقم من خمسة جنود - يقود دبابة من طراز (شيرمان) في مهمة انتحارية خلف خطوط العدو. رغم النقص في العدد والعدة لديهم، إلا أنهم قاموا بدور بطولي للغاية.

النوع : اكشن - دراما - حرب
التصنيف : R
المدة : 2:14:38
التقيم : IMDb 7.6

-Inglourious Basterds (2009)

القصة : تشهد (شوشانا دريفس) مقتل عائلتها على يد رجل نازي يدعى الكولونيل (هانزلاند) وذلك بعد احتلال ألمانيا لفرنسا في الحرب العالمية الثانية، وتتحين الفرصة للانتقام من النازيين، في نفس الوقت الذي تتحرك فيه كتيبة عسكرية لنفس الهدف.

النوع : مغامرة - دراما - حرب
التصنيف : R
المدة : 2:33:00
التقيم : IMDb 8.3`
        },
        {
            command: "#9",
            message: `قائمة افلام دراما ☔:

-The Shawshank Redemption (1994)

القصة : سجينان، أحدهما رجل مصرفي دخل السجن ظلمًا، يكونان معًا صداقة رائعة على مدار السنين، ويجدان السلوى والخلاص في صحبتهما والتي تهون عليهما سنوات سجنهما العصيبة.

النوع : دراما
التصنيف : R
المدة : 2:22:34
التقيم : IMDb 9.3

-Pulp Fiction (1994)

القصة : عبر ثلاث حكايات منفصلة في الظاهر لكنها متصلة في الباطن، يحاول قاتل مأجور إنقاذ زوجة زعيم عصابة من موت محقق، ويواجه ملاكم عواقب إخلاله بإتفاقه مع زعيم العصابة، ويحاول قاتلان مأجوران إخفاء آثار جثة شخص قُتل بالخطأ.

النوع : جريمة - دراما
التصنيف : R 
المدة : 2:34:21
التقيم : IMDb 8.9

-Forrest Gump (1994)

القصة : (فورست جامب) ذو نسبة ذكاء منخفضة جدًا، ترفض والدته إدخاله مدرسة خاصة، وتلحقه بمدرسة عادية، ومنذ ذلك الحين يصنع قدره حتى لو يدرك كنهه تمامًا، بداية من مشاركته في حرب فيتنام، وتحوله إلى رجل أعمال يعمل في صيد الجمبري، وتحوله إلى بطل في الركض.

النوع : دراما - رومانسية
التصنيف : PG-13
المدة : 2:22:10
التقيم : IMDb 8.8

-Fight Club (1999)

القصة : إدوارد يتعرض لضغوطٍ حتى يصل به الحال إلى أنه لا يستطيع النوم لفتراتٍ طويلة، لكنه يجد بعض السلام في جلسات العلاج النفسي الجماعي، يتعرف إدوارد على أحد الأشخاص وهو (تايلر ديردن) الذي يحرره من تعلقه بالأشياء الذي تستعبده ،ثم يحرره من خوفه من الناس. يقومان معًا بإنشاء نادي القتال الذي يجذب الكثير من الأفراد المحبطين ،الذين يقومون بإخراج طاقة غضبهم وكرههم للعالم في القتال.

النوع : دراما
التصنيف : R
المدة : 2:19:09
التقيم : IMDb 8.8`
        },
        {
            command: "#10",
            message: `قائمة افلام كوميدية 😂:

-Dumb and Dumber (1994)

القصة : يتوجه اثنان من مروجى مباريات الملاكمة في لندن إلى تاجر ماس يهودي رغبة في بيع ماسة قيمة له، وعند تواجدهما لديه، يبدأ أحدهما في تذكر ما حدث له الأسبوع الماضي وكيف حصل على تلك الماسة، وعلاقته بأحد الملاكمين الغجر، وكذلك العديد من علاقاته ببعض الأشخاص.

النوع : كوميديا - جريمة
التصنيف : R
المدة : 1:42:46
التقيم : IMDb 8.3 

-Once Upon a Time ... in Hollywood (2019)

القصة : يحاول ممثل تليفزيوني خبت سنوات نجوميته وتألقه بمعاونة دوبليره الذي يساعده في المشاهد الخطرة أن يحققا شيء من الشهرة والنجاح في عالم صناعة السينما خلال العصر الذهبي لهوليوود في عام 1969 بالتزامن مع بدء نشاط القاتل الشهير تشارلز مانسون.

النوع : كوميديا - دراما
التصنيف : R
المدة : 2:41:30
التقيم : IMDb 7.6

-Parasite (2019)

القصة : تدور أحداث الفيلم حول عائلة عاطلة عن العمل، تُقيم داخل شقة فقيرة، تتغير حياتهم كُليًا عندما يلتحق الابن بوظيفة مدرس لابنة عائلة ثرية، وسرعان ما يصير جميع أفراد اﻷسرة الفقيرة عاملين لدى اﻷسرة الثرية.‎

اللغة : الكورية
النوع : كوميديا - دراما - اثارة
التصنيف : R
المدة : 2:11:49
التقيم : IMDb 8.6

-Knives Out (2019)

القصة : عندما يتم العثور على جثة الكاتب الروائي هارلان ثرومبي، يتولى المحقق بلانك على عاتقه مهمة التحقيق في الجريمة، ليجد نفسه متورطًا في العديد من الأحداث في سبيل البحث عن الحقيقة.

النوع : كوميديا - جريمة - دراما
التصنيف : PG-13
المدة : 2:10:15
التقيم : IMDb 7.9`
        },
        {
            command: "#11",
            message: `قائمة افلام اكشن 🔫:

-The Dark Knight ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : سلسلة افلام فارس الظلام
يبدأ باتمان فى محاربة العدو الجديد (الجوكر) الذي يسعى لنشر الذعر والشر في جوثام، وإثبات أن العيش بدون قواعد أفضل، مما يؤدي لصراع بين الاثنين يشترك فيه المفتش جوردن والمدعى العام هارفي دينت وراشيل صديقة بروس وين.

النوع : اكشن - جريمة - دراما
التصنيف : PG-13
المدة : 2:32:14
التقيم : IMDb 9.0

-Die Hard (1988)

القصة : يسافر المحقق (جون مكلين) إلى (لوس أنجلوس) لقضاء عيد الميلاد مع زوجته . وهناك يجد مجموعة إرهابية تسيطر على مبنى وتحتجز مجموعة من الرهائن ، فيحاول التصدي لهم .

النوع : اكشن - اثارة
التصنيف : R 
المدة : 2:12:11
التقيم : IMDb 8.2

-John Wick ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : سلسلة افلام جون ويك
تدور أحداث الفيلم حول القاتل المحترف السابق جون ويك (كيانو ريفز) ، والذي يحدث له شيء يعكر عليه حياته المسالمة الحالية ، حيث يقوم أحد اللصوص باقتحام بيته ، وسرقة سيارته ، وقتل كلبه ، الكلب الذي أعطته له زوجته السابقة ، فيذهب (جون) إلى (نيويورك) سعيا إلى الانتقام من هذا اللص ، ولكن يكتشف أن والد هذا اللص هو زعيم عصابة روسي ، والذي يضع مكافأة لمن يقتل (جون) ، وإذا بـ(ماركوس) الشريك السابق ، وصديق (جون) يحاول الحصول على هذه المكافأة

النوع : اكشن - جريمة - اثارة
التصنيف : R
المدة : 1:41:13
التقيم : IMDb 7.4

-Avatar (2009)

القصة : عندما يكتشف البشر (القمر الفريد باندورا) الذي يحتوي على معدن فائق الأهمية من الناحية الاقتصادية، يقومون بتنفيذ خطة محكمة لغزوه على الفور. لكن على هذا القمر تعيش كائنات زرقاء البشرة تٌدعى (نافي) يتمتعون بحب جارف لكوكبهم وطبيعته المدهشة، ويتصلون معه جسديًا ونفسيًا.. لذا عندما يبدأ هؤلاء في الدفاع عن كوكبهم، ينضم إليهم بعض البشر ليواجهوا قادة الغزو في معركة طاحنة ستحدد مصير باندورا والبشر إلى الأبد.

النوع : اكشن - مغامرة - خيال
التصنيف : PG-13
المدة : 2:58:10
التقيم : IMDb 7.8`
        },
        {
            command: "#12",
            message: `قائمة افلام رومانسية ❤:

-Titanic (1997)

القصة : تسترجع (روز) المسنة ذكريات رحلتها على متن السفينة (تيتانيك) في أولى رحلاتها عبر المحيط الأطلنطي عام 1912، وخضوعها في ذلك الوقت لتحكمات أسرتها التي دبرت لها زيجة من رجل ثري يدعى (كال)، ووقوعها في حب الرسام الفقير (جاك) الباحث عن فرصة جديدة في أمريكا، وما حدث للرحلة التي تحولت إلى كارثة إنسانية مروعة.

النوع : دراما - رومانسية
التصنيف : PG-13
المدة : 3:14:50
التقيم : IMDb 7.8

-Slumdog Millionaire (2008)

القصة : (جمال مالك) شاب فقير نشأ في مومباي، يصبح المتسابق على النسخة الهندية من برنامج (من سيربح المليون؟) ويلقى القبض عليه للإشتباه في الغش في البرنامج، ويجرى استجوابه، وتُظهر الأحداث من تاريخ حياته الصعبة المليئة بالمآسي لكي تفسر لماذا يعلم إجابات الأسئلة.

النوع : دراما - رومانسية
التصنيف : R
المدة : 2:00:38
التقيم : IMDb 8.0

-Amélie (2001)

القصة : يحكي الفيلم قصة الفتاة (إيميلي) التي ولدت في فرنسا. في أثناء طفولتها وبعد تشخيص خاطئ، يعتقد والدها؛ الذي يعمل طبيبًا في الجيش، أن قلبها مريض، فيتم منعها من مغادرة المنزل، ويبدأ تعليمها المنزلي على يد أمها.يتسبب ذلك لإيميلي في حالة من العزلة والانطواء. تبدأ إيميلي في عمر الثانية والعشرين بالعمل في أحد المقاهي القريبة من منزلها، ولكنها ما زالت منطوية ولم تنجح بعد في أية علاقة غرامية.تتغير حياتها كليًا نتيجة بعض الأحداث التي يرتبها لها القدر، وتنطلق الفتاة في رحلة للبحث عن الحب.

اللغة : الفرنسية 
النوع : كوميديا - رومانسية
التصنيف : R
المدة : 2:01:35
التقيم : IMDb 8.3

-Life Is Beautiful (1997)

القصة : تدور أحداث الفيلم في إطار كوميدي درامي في زمن الحرب العالمية الثانية، والذي يحكي قصة يهودي إيطالي يدعى (غيدو أورفيتشي)، الذي يجب أن يوظف خياله الخصب لمساعدة عائلته خلال اعتقالهم في معسكر اعتقال نازي من معسكرات (هتلر)، التي كانت عنصرية إلى أقصى حد، من أجل التغلب على مرارة السجن والاعتقال.

اللغة : الايطالية
النوع : كوميديا - دراما - رومانسية - حرب
*التصنيف" : PG-13
المدة : 1:56:11
التقيم : IMDb 8.6`
        },
        {
            command: "#13",
            message: `قائمة افلام سرفايفل 🌋:

-The Revenant (2015)

القصة : في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع : اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف : R
المدة : 2:36:22
التقيم : IMDb 8.0

-Life of Pi (2012)

القصة : تدور الأحداث حول الصبي الهندي (بي باتيل) نجل حارس حديقة الحيوان، والذي تقرر أسرته الانتقال إلى كندا، وأثناء السفر عبر المحيط الهادي، تغرق السفينة فيجد نفسه وحيدًا مع ضبع وحمار وحشي ونمر على متن المركب، لتبدأ رحلة القتال من أجل البقاء.

النوع : مغامرة - دراما - خيال
التصنيف : PG
المدة : 2:07:00
التقيم : IMDb 7.9

-127 Hours (2010)

القصة : السيرة الذاتية لمتسلق الجبال (آرون رالستون)، تجربته المؤلمة في الحصار لمدة خمسة أيام بين جبلين بفعل حجر ضخم ظل ضاغطاً على يديه ولا يستطيع التخلص منه، مما يدفعه لمحاولة الحفاظ على حياته بكل السبل الممكنة.. ويُوصله لنهاية مأساوية، ولكنها مع ذلك تمنحه حياةً جديدة. .

النوع : سيرة ذاتية - دراما
التصنيف : R
المدة : 1:33:42
التقيم : IMDb 7.5

-Captain Phillips (2013)

القصة : خلال 200 عامٍ لم يجرؤ أحدٌ على الانقضاض على أية سفينةٍ تحمل علمًا أمريكيًا، لكن في عام 2009، تجرأت مجموعة من القراصنة الصوماليين وشنوا الهجوم على سفينة الشحن الأمريكية (ميرسك ألاباما) المحملة بالأسلحة الثقيلة. يُركز الفيلم على شخصية قائد السفينة القبطان ريتشارد فيليبس، وكيف تعامل مع الكارثة. يُطلق الجيش الأمريكي أكبر عملية إنقاذ لإنقاذ طاقم السفينة.

النوع : سيرة ذاتية - دراما - اثارة
التصنيف : PG-13
المدة : 2:14:05
التقيم : IMDb 7.8`
        },
        {
            command: "#14",
            message: `قائمة افلام غموض 👤:

-Se7en (1995)

القصة : تدور قصة الفيلم حول محققان أحدهما عجوز والآخر شاب يتحدان معًا لتولي قضية هي الأخيرة للعجوز والأولى للشاب وتكون مهمتهما فيها القبض على قاتل مجنون يختار ضحاياه من بين مرتكبي الخطايا السبعة المهلكة، كالبدين الذي يأكل بنهم والمحامي الثري نتيجة الجشع وهكذا. ترى هل سينجحان معا في قضيتهما؟

النوع : جريمة - دراما - غموض - اثارة
التصنيف : R
المدة : 2:06:50
التقيم : IMDb 8.6

-Shutter Island (2010)

القصة : في عام 1954، يسافر الضابط الفيدرالي، (إدوارد دانيلز) وشريكه الجديد (تشاك)، إلى إحدى المستشفيات للمجرمين المختلين عقلياً في جزيرة (شاتر)، من أجل التحقيق في قضية أختفاء المريضة (رايتشل)، المسجونة بسبب أغراقها لأطفالها الثلاثة، يقابل (دانيلز) رئيس المشفى الدكتور (جون كولي) الذي يرفض تسليم ملفات العاملين في المستشفى ويمنعهم من تفتيش الجناح (سي) للخطرين، ولكن يحدث ما لم يكن في الحسبان.

النوع : غموض - اثارة
التصنيف : R
المدة : 2:18:05
التقيم : IMDb 8.2

-The Prestige (2006)

القصة : روبيرت أنجاير (هيو جاكمان) وألفريد بوردن (كريستيان بال) جمعتهم الصداقة في أحد الأيام كساحران يعملان سويًا إلى أن تموت زوجة روبيرت في خدعة سحرية لم تتم بنجاح . يتحول الإثنان إلىان إلى أعداء يحاولان دائمًا تحدي بعضهم ولكن يحول هذا التحدي إلى هوس بالنسبة لروبيرت بعد خدعة ألفريد الأخيرة.

النوع : دراما - غموض - خيال علمي - اثارة
التصنيف : PG-13
المدة : 2:10:30
التقيم : IMDb 8.5

-Memento (2000)

القصة : ليونارد محقق جرائم سابق يبحث عن قاتل زوجته. يصاب ليونارد بضربة على رأسه تفقده القدرة على تذكر الأحداث القريبة، مما لا يمكنه من تجميع بعض الأدلة عن جريمة القتل تلك، ولكي يمكْن نفسه من التعامل مع هذه الحالة فأنه يستعين بكتابة العديد من الملاحظات والصور مستخدمًا الوشوم على جسده ليذكر نفسه.

النوع : غموض - اثارة
التصنيف : R
المدة : 1:53:27
التقيم : IMDb 8.4`
        },
        {
            command: "#15",
            message: `قائمة افلام تاريخية 📖:

-Braveheart (1995)

القصة: بعد انقضاء عشرين عامًا من موت والده وشقيقه على يد اﻹنجليز، يعود المناضل الإسكتلندي (وليام والاس) إلى موطنه بعد أن أصبح خبيرًا محنكًا في فنون القتال، ويشكل قوى عسكرية ضارية من سكان قريته والقرى المجاورة يثور بها ضد اﻹنجليز، خاصة بعد مقتل حبيبته التي تزوجها سرًا حتى لا يغتنمها اﻹنجليز ﻷنفسهم.

النوع: سيرة ذاتية - دراما - تاريخ
التصنيف: R
المدة: 2:57:43
التقييم: 8.4 IMDb 

-The Revenant (2015)

القصة: في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع: اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف: R
المدة: 2:36:22
التقييم: 8.0 IMDb 

-The King's Speech (2010)

القصة: يتسلم الملك جورج السادس عرش بريطانيا بعد تنازل شقيقه عنه، وفي ظل مشاكله مع النطق فإنه يعاني من تشكك كل المحيطين به في قدرته على قيادة البلاد خلال نشوب الحرب العالمية الثانية، فيلجأ الملك لمدرب خاص لتدريبه على النطق في ظل مساعدة من زوجته إليزابيث.

النوع: سيرة ذاتية - دراما - تاريخ
التصنيف: R
المدة: 1:58:28
التقييم: 8.0 IMDb 

-Troy (2004)

القصة: يصور الفيلم ملحمة الإلياذة، والتي تحكي قصة حصار مدينة طروادة، حيث قاد أخيل حرب طروادة لمدة عشر سنوات حدثت خلالها واقعة بينه وبين أجاممنون، لأن أجاممنون خطف بيرسيس بنت أخ ملك طروادة، فغضب أخيل واعتزل الحرب وبدأت الهزائم تتوالي علي الإغريق. رأى باتروكلس إبن عم أخيل ماحل بالجيش من هزائم، فحاول أن يجعل أخيل يعود إلى القتال فتآمر ضده لقتله ولكن بدلًا من ذلك قتل صديق أخيل هكتور.

النوع: دراما - تاريخ
التصنيف: R
المدة: 3:16:03
التقييم: 7.3 IMDb`
        },
        {
            command: "#16",
            message: `قائمة افلام الانميشن 🐱:

-WALL·E (2008)

القصة: في المستقبل البعيد نرى البشرية وقد هجرت الكرة الأرضية وذهبت لتعيش في الفضاء، السبب هو امتلاء الأرض بالنفايات والمخلفات التي نتجت عن المنتجات التي تصنعها الشركات العملاقة وتستحوذ بها على عقول الناس. (وال إي) إنسان آلي مخصص للتعامل مع النفايات، تركه سكان الأرض خلفهم ليتعامل وحده مع الفوضى التي تسببوا فيها. يتغير مجرى الأحداث عندما يرسل البشر الآلية (إيفا) من أجل البحث عن دليل يثبت أن الأرض تصلح مجددًا لحياة الإنسان. يساعدها وال إي عند هبوطها إلى الأرض، وتكون هذه هي البداية لقصة حب غريبة من نوعها.

النوع: انيميشن - مغامرة - عائلي - رومانسية - خيال علمي
التصنيف: G
المدة: 1:37:26
التقييم: IMDb 8.4

-Up (2009)

القصة: من خلال ربط آلاف البالونات بسقف منزله، يقرر المسن (كارل فريدريكسين) تحقيق حلم حياته أن يرى براري أمريكا الجنوبية، ويدرك مباشرة بعد الإقلاع أنه ليس وحيدًا في رحلته، لأن (راسل) المستكشف الذي يصغره بـ70 سنة، أصبح من غير قصد مرافقًا في هذه الرحلة.

النوع: انيميشن - مغامرة - كوميديا
التصنيف: PG
المدة: 1:36:08
التقييم: 8.2 IMDb 

-Finding Nemo (2003)

القصة: يتناول الفلم رحلة بحث السمكة (مارلن) عن ابنه (نيمو) ، الذي ضاع في غياهب المحيط ، وعثر عليه أحد الغواصين لينقله من عالم البحار إلى البر ، حيث يعيش في حوض سمك صغير في عيادة طبيب أسنان ، (مارلن) رغم المشاكل التي تواجهه والإحباطات الكثيرة التي تقف حائلا بينه وبين (نيمو) يستمر في رحلة بحثه بصحبة السمكة الطيبة (دوري) حتى يجد (نيمو) أخيرا .

النوع: انيميشن - مغامرة - كوميديا - عائلي
التصنيف: G
المدة: 1:40:54
التقييم: 8.1 IMDb 

-Toy Story ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: (آندي) صبي صغير يهوي الجلوس بغرفته واللعب بألعابه، خاصًة دميته المفضلة (وودي)، وعندما يترك غرفته، تعود دُماه وألعابه إلى الحياة، ويبدأ وودي القلق بخصوص حفل عيد ميلاد آندي، والذي يحصل فيه الصبي على لعبته الجديدة (باظ) فسرعان ما تصبح لعبته المُفضلة الجديدة؛ وهو ما يشعل الصراع بين كٍل من (وودي) و(باظ).

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: G
المدة: 1:21:04
التقييم: 8.3 IMDb`
        },
        {
            command: "#17",
            message: `قائمة افلام الرعب  🔪🚿:

-The Shining (1980)

القصة: جاك مؤلف روايات يصطحب زوجتة وابنه للعمل في فندق منعزل ومغلق خلال فترة الشتاء لسقوط الثلوج عليه. فيقبل العمل به للمحافظة والاعتناء به. ويجد الهدوء فرصة لاستكمال روايته. ولكنه الهدوء الذي يسبق العاصفة حيث يظهر له أشباح تدعوه لقتل زوجته وابنه.

النوع: دراما - رعب
التصنيف: R
المدة: 2:23:46
التقييم: 8.4 IMDb 

-Alien (1979)

القصة: أحد أفلام المخرج الأسطوري (ريدلي سكوت) الأولى ، وأول أفلام سلسلة الخيال العلمي الشهيرة بذات الاسم ، حيث تصل إشارة استغاثة قادمة من الفضاء الخارجي ، وعندما تم إرسال سفينة فضاء من الأرض للتحقيق في الأمر فوجئوا بأنهم تعرضوا لكمين أوشك على التغلب عليهم بدرجة كبيرة والتوجه إلى الأرض للسيطرة عليها ، يحاولون تدارك الموقف بمجهود شاق ، ومعركة ملحمية .

النوع: رعب - خيال علمي
التصنيف: R
المدة: 1:56:37
التقييم: 8.4 IMDb 

-World War Z (2013)

القصة: يرصد الفيلم الكارثة التي حلت بالعالم ،حيث انتشر وباءٌ غريبٌ كالنار في الهشيم في جميع أنحاء العالم وحول كُل من يمسه هذا الوباء لزومبي، ويصارع جيري لين (براد بيت) الزمن والوقت من أجل إنقاذ عائلته والعالم من الفوضى العارمة التي حلت به، ويأخذ (جيري) أمر البحث عن الدواء على عاتقه من أجل إنقاذ البشرية من الهلاك.

النوع: اكشن - مغامرة - رعب - خيال علمي
التصنيف: PG-13
المدة: 2:03:04
التقييم: 7.0 IMDb 

-Psycho (1960)

القصة: تعمل ماريون كرين في أحد المكاتب العقارية بالمدينة وذلك لظروفها الصعبة تتعلق بحب الفتى سام لومس الذي يعاني هو اﻷخر من بعض الظروف المالية السيئة، تقرر ماريون الاستيلاء على مبلغ ماليبلغ مالي من المكتب الذي تعمل به أملا في مساعدته في الوقت ذاته لا يعرف سام أي شيء عن مخططها.

النوع: غموض - اثارة - رعب
التصنيف: R
المدة: 1:48:52
التقييم: 8.5 IMDb`
        },
        {
            command: "#18",
            message: `قائمة افلام عن الويسترن 🤠:

-Django Unchained (2012)

القصة: (جانجو) عبد أسود، يحرره دكتور كينج شولتز (كريستوف والتز) صائد الجوائز من العبودية، ويعقد معه صفقة؛ ليساعده (جانجو) في العثور على بعض الفارين من وجه العدالة، وفي المقابل يساعده (شولتز) في الوصول إلى زوجته الموجودة لدى (كليفين كندي) الإقطاعي الثري الذي يُتاجر في العبيد.

النوع: دراما - غربي
التصنيف: R
المدة: 2:45:22
التقييم: IMDb 8.4

-The Good, the Bad and the Ugly (1966)

القصة: تنضم عملية احتيال لصيد الجوائز إلى رجلين في تحالف غير مستقر ضد رجل ثالث في سباق للعثور على ثروة من الذهب مدفونًا في مقبرة نائية.

النوع: مغامرة - غربي 
التصنيف: R
المدة: 2:58:37
التقييم: IMDb 8.8

-The Revenant (2015)

القصة: في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع: اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف: R
المدة: 2:36:22
التقييم: 8.0 IMDb 

-Unforgiven (1992)

القصة: في أجواء الغرب الأمريكي بمدينة (بيج ويسكي)، تقوم مجموعة من العاهرات بخرق الهدوء الظاهر في البلدة، من خلال وضعهن جائزة مالية لمن يقتل اثنين من رجال الكاوبوي اللذيْن أضرا بزميلتهما (دليلة فيتزجيرالد)، يثير الأمر قلق شريف البلدة السيد (ليتل بيل) راعي البقر الأسبق الذي نجح في فرض الهدوء بالبلدة. ثم يسعى راعي البقر المتقاعد (ويل ماني) مع اثنين من رجاله لفرض الهدوء والنظام في البلدة، واصطياد رجليْ الكاوبوي المطلوبيْن.

النوع: دراما - غربي 
التصنيف: R
المدة: 2:10:41
التقييم: IMDb 8.2`
        },
        {
            command: "#19",
            message: `قائمة افلام موسيقية 🎵:

-The Pianist (2002)

القصة: فيلم مقتبس عن قصة حياة عازف البيانو البولندي فالديك سبيلمان في فترة الحرب العالمية الثانية حينما يجتاح الجيش الألماني بولندا ويحتلها، ويعاني سبيلمان هو وأسرته بسبب انتمائه للديانة اليهودية، وتعمد الألمان التنكيل باليهود وكيفية مطاردتهم والتضييق عليهم وتعذيبهم وقتلهم من دون سبب؛ حسب ادعاء الفيلم ذلك. كما يتعرض للمقاومة البولندية للاحتلال الألماني، وتحرير بولندا على يد الجيش الأحمر السوفيتي.

النوع: سيرة ذاتية - دراما - موسيقي 
التصنيف: R
المدة: 2:28:45
التقييم: IMDb 8.5

-Whiplash (2014)

القصة: قصة حول العلاقة المتقلبة بين المُعلم وتلميذه ، ترانس فليتشر (جي كيه سيمونز) موسيقار جاز متميز ، وهو المُعلم الخاص بقارع الطبول الطموح أندرو نيمان (مايلز تيلر) ، برغم أن أسلوب (ترانس) التعليمي قاس جدًا ، وعنيف لأقصى حد إلا أنه يريد الوصول للكمال والمثالية ، حتى لو كان الثمن هو أن يقسو على طلابه ، فما القَدْر الذي يمكن أن يتحمله العازف الطموح (أندرو) من أجل التميز في عمله؟

النوع: دراما - موسيقي 
التصنيف: R
المدة: 1:46:46
التقييم: IMDb 8.5

-La La Land (2016)

القصة: (ميا) ممثلة طموحة، تُقدم مشروب اللاتيه لنجوم الأفلام فيما بين تجارب الأداء، بينما (سيباستيان) موسيقي متخصص بموسيقى الجاز، شق طريقه بصعوبة من خلال عزف منوعات الأغاني خلال الحفلات في الحانات الحقيرة، ولكن مع تصاعد نجاحاتهما يبدآن في مواجهة القرارات التي تُفكِّك النسيج الهش لعلاقة حبهما.

النوع: كوميديا - دراما - موسيقي -
التصنيف: PG-13
المدة: 2:07:48
التقييم: IMDb 8.0

-Baby Driver (2017)

القصة: ( أنسيل يلجورت) سائق مُهرب شاب وموهوب، يعتمد على أسلوبه الخاص ليتبوأ أفضل مراكز اللعبة، وعندما يلتقي فتاة أحلامه (ليلي جيمس) يرى الفرصة في تغيير حياته وتطهيرها من الجرائم، لكن بعد إجباره على العمل لصالح زعيم الجريمة (كيفن سبايسي) يشعر بالخطر يتهدد حياته، حبه، وحريته.

النوع: اكشن - جريمة - دراما - موسيقي
التصنيف: R
المدة: 1:52:40
التقييم: IMDb 7.6`
        },
        {
            command: "#20",
            message: `قائمة افلام منوعة 🔈:

-Goodfellas (1990)

القصة: (هنري هل) فتى مراهق، ينشأ في حي تحكمه العصابات، يتورط معهم ويشارك في عملية سطو مع (جيمي كونواي)، و(تومي دي فيتو)، واثنين من رجال العصابات الآخرين. يُقتل زميلاه في عملية السطو، ويكون على هل مواجهة الأمر وحده.

النوع: سيرة ذاتية - جريمة - دراما 
التصنيف: R
المدة: 2:25:21
التقييم: IMDb 8.7

-Scent of a Woman (1992)

القصة: الكولونيل المتقاعد فرانك سليد فقد بصره أثناء الخدمة في جيش الولايات المتحدة، تبحث ابنة أخته عن مرافق له ويتقدم طالب فقير لهذه الوظيفة، ويدخل معه في سلسلة من المغامرات غير المتوقعة.

النوع: دراما 
التصنيف: R
المدة: 2:36:25
التقييم: IMDb 8.0

-Ocean's Eleven ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: تدور أحداث الفيلم حول عصابة متخصصة ومحترفة تتكون من 11 فرد بقيادة أوشن، يجتمعون من أجل وضع خطة طموحة ومجنونة لسرقة أكبر ثلاثة كازينوهات للقمار بــ (لاس فيجاس).

النوع: جريمة - اثارة
التصنيف: PG-13
المدة: 1:56:34
التقييم: IMDb 7.8

-The Pursuit of Happyness (2006)

القصة: تدور أحداث الفلم في إطار درامي تراجيدي حول (كريس) الذي يحاول بشتى الطرق توفير سبل الراحة لأسرته الصغيرة ، وبعد أن تهجره زوجته بسبب الفقر يقرر أن يتعلم مهنة جديدة ليحصل منها على المال الكافي ليسعد به ابنه الصغير ، وبعد كثير من المعاناة ينجح أخيرا في الوصول لهدفه ، ويحصل على وظيفة جيدة بالبُورصَة .

النوع: سيرة ذاتية - دراما 
التصنيف: PG-13
المدة: 1:57:27
التقييم: IMDb 8.0`
        },
        {
            command: "#21",
            message: `قائمة افلام عائلية 👨‍👩‍👦‍👦:

-The Incredibles / The Incredibles 2

القصة: يعتبر (بوب بار) المعروف أيضًا باسم مستر (إنكريدبل) وزوجته (هيلين) المعروفة باسم (إيلاستي جيرل) من أعظم وأشهر محاربي الجريمة ضمن زمرة الأبطال الخارقين. يقوم الثنائي دومًا بإنقاذ الحيوات ومحاربة الشر يوميًا، ولكن بمرور السنين يكون عليهما أن يتخفيا وراء شخصيات عادية وعيش حياة طبيعية قدر المستطاع بصحبة أولادهم الصغار، يرغب بوب في العودة إلى حياة الأبطال الخارقين، ولكن تلك الرغبة تقوده إلى طريق شائك، ويكون على الأسرة الصغيرة أن تتحد من أجل مواجهة الخطر المحدق.

النوع: انيميشن - اكشن - مغامرة - عائلي
التصنيف: PG
المدة: 1:55:26
التقييم: IMDb 8.0

-Ratatouille (2007)

القصة: يحلم الفأر (ريمي ) بأن يكون طباخاً ماهراً، وعقب إنفصاله عن عائلته بعد أن اكتشف وكرها، ليصل إلى باريس، ثم يستقر في مطبخ مطعم فاخر، يلتحق الشاب (بلنجويني) للعمل بالمطعم، ويستطيع (ريمي) التحكم فيه عن طريق التحكم في تحريك شعره، مما يجعله طباخاً ماهراً، ويثير غيرة زملائه الطباخين.

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: G
المدة: 1:50:31
التقييم: IMDb 8.0

-Inside Out (2015)

القصة: تدور قصة الفلم حول الطفلة (ريلي) التي تنتقل إلى (سان فرانسيسكو) مع عائلتها ، بعد أن تسلم والدها عملا جديدا هناك ، حيث تتحكم بها بعض المشاعر مثل (السعادة ، الخوف ، الغضب ، الحزن ، الاشمئزاز) ، وتحاول (ريلي) بالمساعدة من مشاعرها الكامنة التي تعطيها نصائح يومية أن تتخطى معاناة الانتقال إلى هذه المدينة الجديدة ، كما تحاول أن تظل محافظة على أحاسيسها اﻹيجابية .

النوع: انيميشن - مغامرة - كوميديا - دراما - عائلي - خيال
التصنيف: PG
المدة: 1:34:38
التقييم: IMDb 8.1

-Shrek ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: (شريك) غول أخضر يعيش في المستنقع وحيدًا مستمتعًا بعزلته، إلى أن يجد في يوم ما كل شخصيات القصص الخيالية ينامون في مستنقعه، فيذهب إلى اللورد فركواد ومعه الحمار مساعده كي يأمرهم بالرحيل، فيطلب منه فركواد أن يذهب لعرين التنين لينقذ الأميرة فيونا.

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: PG
المدة: 1:30:07
التقييم: IMDb 7.8`
        },
        {
            command: "#22",
            message: `قائمة افلام وثائقية 📒:

-Fahrenheit 9/11 (2004)

القصة: تدور أحداث الفيلم حول وجهة نظر مايكل مور في ماحدث في الولايات المتحدة اﻷمريكية مع أحداث 11 سبتمبر، وكيف أن إدارة بوش إستخدمت هذا الحادث المأساوي الكبير للمضي قدمًا في شن الحروب الظالمة على أفغانستان والعراق.

النوع: وثائقي - دراما - حرب
التصنيف: R
المدة: 2:02:22
التقييم: IMDb 7.5

-Super Size Me (2004)

القصة: يستكشف مورجان سبورلوك شخصيًا عواقب صناعة الوجبات السريعة على صحة الإنسان عن طريق إتباع نظام غذائي من شركة ماكدونالدز لمدة شهر كامل لثلاث وجبات يوميًا.

النوع: وثائقي - كوميديا - دراما
التصنيف: PG
المدة: 1:40:00
التقيم: IMDb 7.2

-An Inconvenient Truth (2006)

القصة: تدور أحداث الفيلم الوثائقي حول قضية الإحتباس الحراري تلك المشكلة الخطيرة المعترف بها في جميع أنحاء العالم ويقدم آل جور مجموعة واسعة من الحقائق والمعلومات بطريقة مدروسة ومقنعة كما يطرح الحقائق للجمهور واستنتاجاتهم الخاصة بأسلوب جذاب وساخر.

النوع: وثائقي 
التصنيف: PG
المدة: 1:36:00
التقييم: IMDb 7.4

-The Social Dilemma (2020)

القصة: يستعرض المخاطر الكبيرة لمواقع التواصل الاجتماعي على حياة البشر مع صانعي التكنلوجيا الذين يحذرون من مخاطر ما صنعوه

النوع: وثائقي - دراما 
التصنيف: PG-13
المدة: 1:34:31
التقييم: IMDb 7.6`
        },
    ],
    `◾ترتيب سلاسل الافلام◾

1-ترتيب افلام مارفل 🔥🕷
2-ترتيب افلام Star wars ⭐️  ⚔️ 
3-ترتيب افلام عالم Lord of the rings  
4-ترتيب افلام Dc ⚡️🦇
5-ترتيب افلام X men  🌪💥
6-ترتيب افلام هاري بوتر 🧹


🔹افضل الافلام لمختلف التصنيفات🔹

7-افلام خيال علمي 🎆
8-افلام حربية 💣
9-افلام دراما ☔
10-افلام كوميدية 😂
11-افلام اكشن 🔫
12-أفلام رومانسية ❤
13-افلام سرفايفل 🌋
14-أفلام غموض 👤
15-أفلام تاريخية 📖
16-أفلام انميشن 🐱
17-افلام رعب  🔪🚿
18-أفلام عن الويسترن 🤠
19-أفلام موسيقية 🎵
20-أفلام منوعة 🔈
21-افلام عائلية 👨‍👩‍👦‍👦
22-افلام وثائقية 📒`
)

const helpBot2 = new HelpBot("#jarvis", "#جارفيس", "120363026234217828@g.us");
helpBot2.AddCommand("#جارفيس", `「الــبـــــوت 🤖 جارفيس」
─━─━─━∞◆∞━─━─

•| قـائـمـة الاوامـر :


أرسـل「 #جارفيس القوانين」
📃 ┊لعرض النظام والقوانين في الكتيبة.


أرسـل「 #جارفيس توصيات」
⚜ ┊لعرض التوصيات سواء افلام او مسلسلات او سلاسل افلام.

أرسل「#جارفيس مشاهدة」
📺 ┊لعرض المواقع العربية التي يمكنك منها مشاهدة الافلام والمسلسلات مترجمة.
 

أرسل「#جارفيس تلقرام」
🔱  | لعرض قائمة مسلسلات الخاصة بتلقرام وتم تنزيلها بجميع مواسمها.

أرسل「#جارفيس مشاركات」
🏷| لعرض المشاركات اليومةو الاسبوعية.

 
─━─━─━∞◆∞━─━─`);
helpBot2.AddCommand("#jarvis", `「الــبـــــوت 🤖 جارفيس」
─━─━─━∞◆∞━─━─

•| قـائـمـة الاوامـر :


أرسـل「 #جارفيس القوانين」
📃 ┊لعرض النظام والقوانين في الكتيبة.


أرسـل「 #جارفيس توصيات」
⚜ ┊لعرض التوصيات سواء افلام او مسلسلات او سلاسل افلام.

أرسل「#جارفيس مشاهدة」
📺 ┊لعرض المواقع العربية التي يمكنك منها مشاهدة الافلام والمسلسلات مترجمة.
 

أرسل「#جارفيس تلقرام」
🔱  | لعرض قائمة مسلسلات الخاصة بتلقرام وتم تنزيلها بجميع مواسمها.

أرسل「#جارفيس مشاركات」
🏷| لعرض المشاركات اليومةو الاسبوعية.

 
─━─━─━∞◆∞━─━─`);
helpBot2.AddCommand("مشاهدة", `~ 「مواقع مشاهدة و تحميل أفلام و مسلسلات 🎬」~ 
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
1- fushaar.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
2 - egy.best
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
3- egybest.co
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
4 - movs4u.tv
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
5 - akoam.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
6-  movizland.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
7-  cimaclub.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
8-  Cima4u.tv
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
9 -  mycima.tv  
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
10 -  imovie-time.co
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
11 - https://www.faselhd.live/
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
~"「مشاهدة ممتعة」"  🖤🎥~"🔆مشاهدة ممتعة🔆"  🖤🎥`);
helpBot2.AddCommand("مشاهده", `~ 「مواقع مشاهدة و تحميل أفلام و مسلسلات 🎬」~ 
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
1- fushaar.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
2 - egy.best
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
3- egybest.co
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
4 - movs4u.tv
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
5 - akoam.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
6-  movizland.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
7-  cimaclub.com
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
8-  Cima4u.tv
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
9 -  mycima.tv  
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
10 -  imovie-time.co
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
11 - https://www.faselhd.live/
≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕≖≔≖≕
~"「مشاهدة ممتعة」"  🖤🎥~`);
helpBot2.AddCommand("قوانين", `✪✶⬇︎✶ القوانين ✶⬇︎✶✪*
┵•يرجى الالتزام بها بالحرف الواحد•┲
1-❃ احترام اراء الجميع بجميع انواعها
2-❃ عدم تكرار الأخبار الا في حالة عدم معرفتك بتواجده في الكتيبة
3-❃ عدم حرق الاحداث عن طريق التلميح او عرض احدى المقاطع المقصوصة او الكاملة
4-❃ عدم تسريب ما شاهدته بالسينما ك ظهور اول. مراعاً للكل
5-❃ العنصرية والمواضيع السياسية و الدينية و المواضيع المخلة بالأدب و المواضيع خارج نطاق الكتيبة  
6-❃ ممنوع اكثر من مشاركتين باليوم
7-❃ ممنوع حذف ثلاث رسائل دفعة واحدة
8-❃ يسمح للمشرفين بتطبيق قوانين جديدة تتناسب معه`);
helpBot2.AddCommand("مشاركة", `✪✶⬇︎✶ المشاركات ✶⬇︎✶✪*
1-❃ التوصيات في اليوم 2
2-❃ الانطباع في اليوم 2
3-❃ الأخبار في اليوم20
4-❃ البحث في الأسبوع 2`);
helpBot2.AddCommand("مشاركه", `✪✶⬇︎✶ المشاركات ✶⬇︎✶✪*
1-❃ التوصيات في اليوم 2
2-❃ الانطباع في اليوم 2
3-❃ الأخبار في اليوم20
4-❃ البحث في الأسبوع 2`);
helpBot2.AddCommand("مشاركات", `✪✶⬇︎✶ المشاركات ✶⬇︎✶✪*
1-❃ التوصيات في اليوم 2
2-❃ الانطباع في اليوم 2
3-❃ الأخبار في اليوم20
4-❃ البحث في الأسبوع 2`);
helpBot2.AddCommand("تلقرام", `⚠️قائمة المسلسلات الخاصة بتلقرام وتم تنزيلها بجميع المواسم..🔥👇
        And Then There Were None
https://t.me/joinchat/SWHQL0_ft3M0QLg7

11.22.63
https://t.me/joinchat/AAAAAFc3hhXiDlAb2JiGPA

Barry
https://t.me/joinchat/AAAAAFceXOyjd5KxKxMViQ

Banshee
https://t.me/joinchat/AAAAAEl0jMpm5sYyN_6P7w

Band Of Brothers
https://t.me/joinchat/VMJT_JxhM0RCsXej

Boardwalk Empire
https://t.me/joinchat/UjEEorK2TIg86d4E

Black Sails
https://t.me/joinchat/T7Hpb5Ni1qSGaChL

Better Call Saul
https://t.me/joinchat/THE5aOTQeqgdogW-

Brooklyn Nine Nine
https://t.me/joinchat/AAAAAEoohPhQt2Mjd0dXzg

Breaking Bad 
https://t.me/joinchat/AAAAAEmwajZV8pDprR5nzg

Bodyguard
https://t.me/joinchat/VphgvLn9ocmhaDoR

Deadwood
https://t.me/joinchat/SsjvHXzoWQIGO7NT

Dark
https://t.me/joinchat/AAAAAFKrWX0sZ7BqyYOt5w

Chernobyl
https://t.me/joinchat/AAAAAEg5feMVDsR3VtLGlA

Friends
https://t.me/joinchat/BmkT_TBQCO5iNjFk

Fargo
https://t.me/joinchat/UPqowfARqqpubuTc

Dexter
https://t.me/joinchat/AAAAAFfULZbKxTNDr8sWFA

Game Of Thrones
https://t.me/joinchat/DCohRsTIAI9iYmM8

Hannibal
https://t.me/joinchat/Rf1G5Qyscz0-kV6b

Hell On Wheels
https://t.me/joinchat/AAAAAExTCx3BmpVY-H0-YQ

His Dark Materials
https://t.me/joinchat/U8hRLvvFUlpiGZ3O

House
https://t.me/joinchat/R-yFyGDR67TKn16f

Justified
https://t.me/joinchat/AAAAAFbHuN4gdQ9MkyAwIQ

Kingdom
https://t.me/joinchat/AAAAAFGF6om-B5-lTn9qig

Legion
https://t.me/joinchat/AAAAAEvYpukczRUxApee5A

Loki
https://t.me/joinchat/mH59ie3YDJhhYWU0

Lost
https://t.me/joinchat/TYB_SKDFax_vYty6

Luther
https://t.me/joinchat/T3s4ZxUHKOfsmBR5

Mindhunter
https://t.me/joinchat/UuDKcJMw1GQjF_sL

MadMen
https://t.me/madmenseries

Daredevil
https://t.me/joinchat/AAAAAEaCvVHJxTXaDilcUg

The Punisher
https://t.me/joinchat/AAAAAEyEb4ycurNpHQ8zsA

Mr inbetween
https://t.me/joinchat/AAAAAFQmLfoSbpf2cS3_9w

Mr. Robot
https://t.me/joinchat/SBFEsMnNYtTPd3uz

Outlander
https://t.me/joinchat/AAAAAFELi-TLMODDNmpXkw

O.Z
https://t.me/joinchat/SaPRNbd24yd1Adqd

Ozark
https://t.me/joinchat/VbpbYzBIRaMTrQ8F

Peaky Blinders
https://t.me/joinchat/AAAAAE97RY

Person Of Interest
https://t.me/joinchat/AAAAAEbGvuA2IiNBfq-MvQ

Ray Donovan
https://t.me/joinchat/AAAAAFBXQiqj9ZkcZKHRJg

Rectify
https://t.me/joinchat/AAAAAFTwGwmbu5RaqS7Ebg

Sherlock
https://t.me/joinchat/AAAAAEdhcoQInXtw72Uz7A

Sons Of Anarchy
https://t.me/joinchat/UfPjudxeZcGDh-jX

Suits
https://t.me/joinchat/Tqn_7cIjylXafyvB

Taboo
https://t.me/joinchat/V97dQgwYn0btIjbl

Ted Lasso
https://t.me/joinchat/RVKWld6FLkMxZDM0

THE100
https://t.me/The_100_o

The Americans
https://t.me/joinchat/AAAAAFScyeJVy3R596pS3A

The Boys
https://t.me/joinchat/WUwugsjjGZ3nusNv

The Great Train Robbery
https://t.me/joinchat/AAAAAFZ1qsg5D5xtn3r7KQ

The Last Kingdom
https://t.me/joinchat/AAAAAFhlXEdLRy_LbJVy8w

The Leftovers
https://t.me/joinchat/STp6oDWEE9vrwQee

The Night Of
https://t.me/joinchat/TjTD2wCRMjDPkdJI

The Office
https://t.me/joinchat/TOMgKeifMfj-SWIa

The Shield
https://t.me/joinchat/AAAAAESjSaciG0B7rqEIag

The Sopranos
https://t.me/joinchat/Slm_YcrRdQJWcGRk

The Walking Dead
https://t.me/joinchat/AAAAAEdByLoeYsr6yLBHdA

The Wire
https://t.me/joinchat/S90FGeNX3zSvq8CT

True Detective
https://t.me/joinchat/TrOJYAJp1M8k3cZe

Vikings
https://t.me/joinchat/AAAAAFKSzV5vOinn6qk1Nw

WandaVision
https://t.me/joinchat/R9yTFGbXP3w0xgUo

Westworld
https://t.me/joinchat/WKPFlBCJFFSaHunE

Harper's Island
https://t.me/shortseries/1318`);
helpBot2.AddCommand("ستيكر", null, false, false, null, null, "", true)

helpBot2.AddCommand(
    "توصيات",
    `سيعرض لك جارفيس قائمة بها عدّة خيارات وخانات...
قم باختيار ما تريده منه…
لعرض القائمة قم بكتابة 1#  او على حسب الرقم الذي تريده  

ستظهر القائمة بعد ثلاث ثواني`,
    false,
    true,
    [],
    [
        {
            "command": "#1",
            "message": `ترتيب افلام مارفل حسب الترتيب الزمني 🔥🕷

• المرحلة الأولى 

1- Iron man

2- The Incredible Hulk

3- Iron man 2

4- Thor

5- Captain America: the first avenger 

6- The Avengers 

• المرحلة الثانية

7- Iron man 3

8- Thor: The Dark World 

9- Captain America: the winter soldier 

10- Guardians of the Galaxy 

11- Avengers : Age of Ultron

12- Ant-Man

• المرحلة الثالثة

13- Captain America: Civil War 

14- Doctor Strange

15- Guardians of the Galaxy VOL.2

16- Spider-Man: Homecoming 

17- Thor: Ragnarok

18- Black Panther

19- Avengers : Infinity War

20- Ant-Man WASP

21- Captain Marvel 

22- Avengers : End Game

23- Spider-Man: Far from Home 

• المرحلة الرابعة

24- WandaVision ˢᵉʳᶦᵉˢ

25- The Falcon and The Winter Soldier ˢᵉʳᶦᵉˢ

26- LOKI ˢᵉʳᶦᵉˢ

27- Black Widow

28- WHAT IF..? ˢᵉʳᶦᵉˢ

29- Shang-Chi and The Legend of The Ten Rings

30- Eternals

31- Hawkeye ˢᵉʳᶦᵉˢ 

32- Spider-Man: No Way Home 

33- Moon Knight ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ᴹᵃʳᶜʰ ³⁰ ²⁰²²

34- Doctor Strange in the madness of the multiverse ˢᵒᵒⁿ ᴹᵃʸ ⁶ ²⁰²² 

35- Ms. Marvel ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ²⁰²²

36- Thor: Love and Thunder ˢᵒᵒⁿ ᴶᵘˡʸ ²⁰²²

37- She-Hulk ˢᵒᵒⁿ ˢᵉʳᶦᵉˢ ²⁰²²

38- Black Panther: Wakanda Forever ˢᵒᵒⁿ ²⁰²² 

39- Im Groot ²⁰²²`
        },
        {
            "command": "#2",
            "message": `ترتيب افلام Star Wars ⭐⚔️

1- A New Hope (1977)

2- The Empire Strikes Back (1980)

3- Return of the Jedi (1983)

4- The Phantom Menace (1999)

5- Attack of the Clones (2002)

6- Revenge of the Sith (2005)

7- The Force Awakens (2015)

8- Rogue One (2016)

9- The Last Jedi (2017)

10- Star Wars Solo (2018)

11- Star Wars: The Rise of Skywalker (2019)

12- The Mandalorian ˢᵉʳᶦᵉˢ

13- Boba Fett ˢᵉʳᶦᵉˢ`
        },
        {
            "command": "#3",
            "message": `ترتيب افلام عالم The Lord of The Rings

1-The Lord of The Rings: The Fellowship of The Ring (2001)

2-The Lord of The Rings: The Two Towers (2002)

3-The Lord of The Rings: The Return of The king (2003)

بعدها نرجع للماضي لمشاهدة ثلاثية اخرى لقصة اخرى في نفس العالم

4-The Hobbit: An Unexpected Journey (2012)

5-The Hobbit: The Desolation of Smaug (2013)

6-The Hobbit: The Battle of The Five Armies (2014)

مسلسل مشتق من السلسلة احداثه قبل الافلام 
The Lord of The Rings series ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ`
        },
        {
            "command": "#4",
            "message": `ترتيب افلام Dc حسب الترتيب الزمني⚡️🦇

Man of Steel (2013)

Batman v Superman: Dawn of Justice (2016)

Suicide Squad (2016)

Wonder Woman (2017)

Zack Snyder’s Justice League (2021)

Aquaman (2018)

Shazam! (2019)

Birds of Prey: and the Fantabulous Emancipation of One Harley Quinn (2020)

Wonder Woman 1984 (2021) 

The Suicide Squad (2021) 

Peacemaker (2022) ˢᵉʳᶦᵉˢ

The Batman (2022)

Black Adam (2022) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

Shazam! Fury of the Gods (2022) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

Aquaman and the Lost Kingdom (2023) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ

The Flash (2023) ᶜᵒᵐᶦⁿᵍ ˢᵒᵒⁿ`
        },
        {
            "command": "#5",
            "message": `ترتيب افلام X-men حست الترتيب الزمني 🌪💥

1- X-MEN (2000)

2- X-MEN2 (2003)

3- X-Men: The Last Stand (2006)

4- X-Men Origins: Wolverine (2009)

5- X-Men: First Class (2011)

6- The Wolverine (2013)

7- X-Men: Days of Future Past (2014)

8- Deadpool (2016)

9- X-Men: Apocalypse (2016)

10- Logan (2017)

11- Deadpool 2 (2018)

12- Dark Phoenix (2019)`
        },
        {
            "command": "#6",
            "message": `ترتيب أفلام Harry Potter🧹


1 - Harry Potter and the Sorcerer's Stone (2001)

2 - Harry Potter and the Chamber of Secrets (2002)

3 - Harry Potter and the Prisoner of Azkaban (2004)

4 - Harry Potter and the Goblet of Fire (2005)

5 - Harry Potter and the Order of Phoenix (2007)

6 - Harry Potter and the Half-Blood Prince (2009)

7 - Harry Potter and the Deathly Hallows  - Part 1 (2010)

8 - Harry Potter and the Deathly Hallows  - Part 2 (2011)

بعدها نرا سلسلة افلام اخرى لم تنتهي في نفس عالم السحرة في الماضي مكونة من خمسة اجزاء نزل منها ٢ والجزء الثالث قادم الى السينما في سنة 2022
1 - Fantastic Beasts and Where to Find Them (2016)
2 - Fantastic Beasts: The Crimes of Grindelwald (2018)
3 - Fantastic Beasts: The Secrets of Dumbledore (2022) ˢᵒᵒⁿ`
        },
        {
            "command": "#7",
            "message": `قائمة افلام خيال علمي 🎆:

-Inception (2010)

القصة : كوب (ليوناردو دي كابريو) هو عميل من طراز خاص جدًا ومستوى رفيع للغاية، في الواقع هو متسلل أحلام! يقوم بتجنيده رجل أعمال فاحش الثراء يدعى (سايتو) كي يقوم بالتسلل إلى عقل أحد منافسيه يدعى (روبرت فيشر) بمساعدة جهاز خاص، بزرع فكرة داخل عقل الرجل تبدو وكأنها تأتي من داخله هو نفسه، وليست من الخارج. الفكرة هي أن يفكك الرجل شركات أبيه التي سيورثها عنه.

النوع : اكشن - مغامرة - خيال علمي
التصنيف : PG-13
المدة : 2:28:09
التقيم : IMDb 8.8

-Interstellar (2014)

القصة : تنتشر الأتربة في بقاع اﻷرض، والأمراض التي تضرب الموارد الطبيعية، ويصبح الجنس البشري معرض للفناء؛ بسبب نقص الطعام وانتشار الأوبئة، ولذلك يسعى مجموعة من المستكشفين بقيادة الطيار (كوبر) إلى السفر في رحلة فضائية مجهولة من خلال الثقب الدودي من أجل البحث عن موطن وكوكب آخر يصلح للحياة من أجل إنقاذ البشرية.

النوع : مغامرة - دراما - خيال علمي
التصنيف : PG-13
المدة : 2:49:04
التقيم : IMDb 8.7

-The Matrix (1999)

القصة : يحاول مبرمج الكمبيوتر توماس أندرسون الذي يعمل تحت اسم مستعار (نيو) كقرصان حواسيب، وفي عالم الانترنت يحاول معرفة ما يحدث داخل عالم ماتريكس، فينضم إلى المجموعة بعد تناوله حبة حمراء تحرره وتعزله عن عالمه ويكتشف نيو أنه يعيش في العام 2199 تقريبًا، حيث أن هناك حرب بدأت بين الآلات وبين الجنس البشري.

النوع : اكشن - خيال علمي 
التصنيف : R 
المدة : 2:16:19 
التقيم : IMDb 8.6

-Jurassic Park ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : رجل أعمال عجوز ثري للغاية يدعى جون هاموند يحلم بإنشاء حديقه للحيوانات المنقرضة في أحد الجزر النائية في كوستاريكا، وبالفعل ينجح في استنساخ خمسة عشر فصيلة مختلفة من الديناصورات عن طريق استخلاص المادة الوراثية (الدنا) الخاصة بهم من البعوض المحفوظ داخل الكهرمان المتحجر.

النوع : اكشن - مغامرة - خيال علمي - اثارة
التصنيف : PG-13
المدة : 2:06:29
التقيم : IMDb 8.2`
        },
        {
            command: "#8",
            message: `قائمة افلام حربية 💣:

-Hacksaw Ridge (2016)

القصة : (ديزموند ت. دوس) مُسعف في الجيش الأمريكي خلال الحرب العالمية الثانية، والذي خدم في معركة (أوكيناوا) رافضًا قتل البشر تحت أي مسمى حتى خلال الحرب، كما أصبح أول مستنكف سلمي رافض للقتلتل في تاريخ العسكرية الأمريكية يتسلم ميدالية الكونجرس الشرفية، حيث شارك خلال الحرب العالمية الثانية دون حمل بندقية.

النوع : سيرة ذاتية - دراما - تاريخ - حرب
التصنيف : R
المدة : 2:19:20
التقيم :IMDb 8.1

-Saving Private Ryan (1998)

القصة : تدور أحداث الفلم أثناء الحرب العالمية الثانية في معركة (نورماندي) تحديدا ، حيث يكلف الرئيس الأمريكي كتيبة بقيادة الكابتن ميلر (توم هانكس) بالذهاب إلى قلب المعركة وراء خطوط العدو ، والبحث عن الجندي ريان (مات ديمون) ، والحفاظ على سلامته حتى يعود إلى والدته التي فقدت ثلاثة من أبنائها في الحرب الدائرة ، ولم يتبقَ لها سوى (ريان) . يخوض الكابتن (ميلر) العديد من المعارك أملا في الوصول إلى (ريان) .

النوع : دراما - حرب
التصنيف : R
المدة : 2:48:21
التقيم : IMDb 8.6

-Fury (2014)

القصة : في أبريل عام 1945 حينما كان الحلفاء يضعون لمساتهم الأخيرة على مسرح الأحداث الأوروبية، كان الخبير الحربي الرقيب واردادي (براد بيت) - وتحت قيادته طاقم من خمسة جنود - يقود دبابة من طراز (شيرمان) في مهمة انتحارية خلف خطوط العدو. رغم النقص في العدد والعدة لديهم، إلا أنهم قاموا بدور بطولي للغاية.

النوع : اكشن - دراما - حرب
التصنيف : R
المدة : 2:14:38
التقيم : IMDb 7.6

-Inglourious Basterds (2009)

القصة : تشهد (شوشانا دريفس) مقتل عائلتها على يد رجل نازي يدعى الكولونيل (هانزلاند) وذلك بعد احتلال ألمانيا لفرنسا في الحرب العالمية الثانية، وتتحين الفرصة للانتقام من النازيين، في نفس الوقت الذي تتحرك فيه كتيبة عسكرية لنفس الهدف.

النوع : مغامرة - دراما - حرب
التصنيف : R
المدة : 2:33:00
التقيم : IMDb 8.3`
        },
        {
            command: "#9",
            message: `قائمة افلام دراما ☔:

-The Shawshank Redemption (1994)

القصة : سجينان، أحدهما رجل مصرفي دخل السجن ظلمًا، يكونان معًا صداقة رائعة على مدار السنين، ويجدان السلوى والخلاص في صحبتهما والتي تهون عليهما سنوات سجنهما العصيبة.

النوع : دراما
التصنيف : R
المدة : 2:22:34
التقيم : IMDb 9.3

-Pulp Fiction (1994)

القصة : عبر ثلاث حكايات منفصلة في الظاهر لكنها متصلة في الباطن، يحاول قاتل مأجور إنقاذ زوجة زعيم عصابة من موت محقق، ويواجه ملاكم عواقب إخلاله بإتفاقه مع زعيم العصابة، ويحاول قاتلان مأجوران إخفاء آثار جثة شخص قُتل بالخطأ.

النوع : جريمة - دراما
التصنيف : R 
المدة : 2:34:21
التقيم : IMDb 8.9

-Forrest Gump (1994)

القصة : (فورست جامب) ذو نسبة ذكاء منخفضة جدًا، ترفض والدته إدخاله مدرسة خاصة، وتلحقه بمدرسة عادية، ومنذ ذلك الحين يصنع قدره حتى لو يدرك كنهه تمامًا، بداية من مشاركته في حرب فيتنام، وتحوله إلى رجل أعمال يعمل في صيد الجمبري، وتحوله إلى بطل في الركض.

النوع : دراما - رومانسية
التصنيف : PG-13
المدة : 2:22:10
التقيم : IMDb 8.8

-Fight Club (1999)

القصة : إدوارد يتعرض لضغوطٍ حتى يصل به الحال إلى أنه لا يستطيع النوم لفتراتٍ طويلة، لكنه يجد بعض السلام في جلسات العلاج النفسي الجماعي، يتعرف إدوارد على أحد الأشخاص وهو (تايلر ديردن) الذي يحرره من تعلقه بالأشياء الذي تستعبده ،ثم يحرره من خوفه من الناس. يقومان معًا بإنشاء نادي القتال الذي يجذب الكثير من الأفراد المحبطين ،الذين يقومون بإخراج طاقة غضبهم وكرههم للعالم في القتال.

النوع : دراما
التصنيف : R
المدة : 2:19:09
التقيم : IMDb 8.8`
        },
        {
            command: "#10",
            message: `قائمة افلام كوميدية 😂:

-Dumb and Dumber (1994)

القصة : يتوجه اثنان من مروجى مباريات الملاكمة في لندن إلى تاجر ماس يهودي رغبة في بيع ماسة قيمة له، وعند تواجدهما لديه، يبدأ أحدهما في تذكر ما حدث له الأسبوع الماضي وكيف حصل على تلك الماسة، وعلاقته بأحد الملاكمين الغجر، وكذلك العديد من علاقاته ببعض الأشخاص.

النوع : كوميديا - جريمة
التصنيف : R
المدة : 1:42:46
التقيم : IMDb 8.3 

-Once Upon a Time ... in Hollywood (2019)

القصة : يحاول ممثل تليفزيوني خبت سنوات نجوميته وتألقه بمعاونة دوبليره الذي يساعده في المشاهد الخطرة أن يحققا شيء من الشهرة والنجاح في عالم صناعة السينما خلال العصر الذهبي لهوليوود في عام 1969 بالتزامن مع بدء نشاط القاتل الشهير تشارلز مانسون.

النوع : كوميديا - دراما
التصنيف : R
المدة : 2:41:30
التقيم : IMDb 7.6

-Parasite (2019)

القصة : تدور أحداث الفيلم حول عائلة عاطلة عن العمل، تُقيم داخل شقة فقيرة، تتغير حياتهم كُليًا عندما يلتحق الابن بوظيفة مدرس لابنة عائلة ثرية، وسرعان ما يصير جميع أفراد اﻷسرة الفقيرة عاملين لدى اﻷسرة الثرية.‎

اللغة : الكورية
النوع : كوميديا - دراما - اثارة
التصنيف : R
المدة : 2:11:49
التقيم : IMDb 8.6

-Knives Out (2019)

القصة : عندما يتم العثور على جثة الكاتب الروائي هارلان ثرومبي، يتولى المحقق بلانك على عاتقه مهمة التحقيق في الجريمة، ليجد نفسه متورطًا في العديد من الأحداث في سبيل البحث عن الحقيقة.

النوع : كوميديا - جريمة - دراما
التصنيف : PG-13
المدة : 2:10:15
التقيم : IMDb 7.9`
        },
        {
            command: "#11",
            message: `قائمة افلام اكشن 🔫:

-The Dark Knight ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : سلسلة افلام فارس الظلام
يبدأ باتمان فى محاربة العدو الجديد (الجوكر) الذي يسعى لنشر الذعر والشر في جوثام، وإثبات أن العيش بدون قواعد أفضل، مما يؤدي لصراع بين الاثنين يشترك فيه المفتش جوردن والمدعى العام هارفي دينت وراشيل صديقة بروس وين.

النوع : اكشن - جريمة - دراما
التصنيف : PG-13
المدة : 2:32:14
التقيم : IMDb 9.0

-Die Hard (1988)

القصة : يسافر المحقق (جون مكلين) إلى (لوس أنجلوس) لقضاء عيد الميلاد مع زوجته . وهناك يجد مجموعة إرهابية تسيطر على مبنى وتحتجز مجموعة من الرهائن ، فيحاول التصدي لهم .

النوع : اكشن - اثارة
التصنيف : R 
المدة : 2:12:11
التقيم : IMDb 8.2

-John Wick ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة : سلسلة افلام جون ويك
تدور أحداث الفيلم حول القاتل المحترف السابق جون ويك (كيانو ريفز) ، والذي يحدث له شيء يعكر عليه حياته المسالمة الحالية ، حيث يقوم أحد اللصوص باقتحام بيته ، وسرقة سيارته ، وقتل كلبه ، الكلب الذي أعطته له زوجته السابقة ، فيذهب (جون) إلى (نيويورك) سعيا إلى الانتقام من هذا اللص ، ولكن يكتشف أن والد هذا اللص هو زعيم عصابة روسي ، والذي يضع مكافأة لمن يقتل (جون) ، وإذا بـ(ماركوس) الشريك السابق ، وصديق (جون) يحاول الحصول على هذه المكافأة

النوع : اكشن - جريمة - اثارة
التصنيف : R
المدة : 1:41:13
التقيم : IMDb 7.4

-Avatar (2009)

القصة : عندما يكتشف البشر (القمر الفريد باندورا) الذي يحتوي على معدن فائق الأهمية من الناحية الاقتصادية، يقومون بتنفيذ خطة محكمة لغزوه على الفور. لكن على هذا القمر تعيش كائنات زرقاء البشرة تٌدعى (نافي) يتمتعون بحب جارف لكوكبهم وطبيعته المدهشة، ويتصلون معه جسديًا ونفسيًا.. لذا عندما يبدأ هؤلاء في الدفاع عن كوكبهم، ينضم إليهم بعض البشر ليواجهوا قادة الغزو في معركة طاحنة ستحدد مصير باندورا والبشر إلى الأبد.

النوع : اكشن - مغامرة - خيال
التصنيف : PG-13
المدة : 2:58:10
التقيم : IMDb 7.8`
        },
        {
            command: "#12",
            message: `قائمة افلام رومانسية ❤:

-Titanic (1997)

القصة : تسترجع (روز) المسنة ذكريات رحلتها على متن السفينة (تيتانيك) في أولى رحلاتها عبر المحيط الأطلنطي عام 1912، وخضوعها في ذلك الوقت لتحكمات أسرتها التي دبرت لها زيجة من رجل ثري يدعى (كال)، ووقوعها في حب الرسام الفقير (جاك) الباحث عن فرصة جديدة في أمريكا، وما حدث للرحلة التي تحولت إلى كارثة إنسانية مروعة.

النوع : دراما - رومانسية
التصنيف : PG-13
المدة : 3:14:50
التقيم : IMDb 7.8

-Slumdog Millionaire (2008)

القصة : (جمال مالك) شاب فقير نشأ في مومباي، يصبح المتسابق على النسخة الهندية من برنامج (من سيربح المليون؟) ويلقى القبض عليه للإشتباه في الغش في البرنامج، ويجرى استجوابه، وتُظهر الأحداث من تاريخ حياته الصعبة المليئة بالمآسي لكي تفسر لماذا يعلم إجابات الأسئلة.

النوع : دراما - رومانسية
التصنيف : R
المدة : 2:00:38
التقيم : IMDb 8.0

-Amélie (2001)

القصة : يحكي الفيلم قصة الفتاة (إيميلي) التي ولدت في فرنسا. في أثناء طفولتها وبعد تشخيص خاطئ، يعتقد والدها؛ الذي يعمل طبيبًا في الجيش، أن قلبها مريض، فيتم منعها من مغادرة المنزل، ويبدأ تعليمها المنزلي على يد أمها.يتسبب ذلك لإيميلي في حالة من العزلة والانطواء. تبدأ إيميلي في عمر الثانية والعشرين بالعمل في أحد المقاهي القريبة من منزلها، ولكنها ما زالت منطوية ولم تنجح بعد في أية علاقة غرامية.تتغير حياتها كليًا نتيجة بعض الأحداث التي يرتبها لها القدر، وتنطلق الفتاة في رحلة للبحث عن الحب.

اللغة : الفرنسية 
النوع : كوميديا - رومانسية
التصنيف : R
المدة : 2:01:35
التقيم : IMDb 8.3

-Life Is Beautiful (1997)

القصة : تدور أحداث الفيلم في إطار كوميدي درامي في زمن الحرب العالمية الثانية، والذي يحكي قصة يهودي إيطالي يدعى (غيدو أورفيتشي)، الذي يجب أن يوظف خياله الخصب لمساعدة عائلته خلال اعتقالهم في معسكر اعتقال نازي من معسكرات (هتلر)، التي كانت عنصرية إلى أقصى حد، من أجل التغلب على مرارة السجن والاعتقال.

اللغة : الايطالية
النوع : كوميديا - دراما - رومانسية - حرب
*التصنيف" : PG-13
المدة : 1:56:11
التقيم : IMDb 8.6`
        },
        {
            command: "#13",
            message: `قائمة افلام سرفايفل 🌋:

-The Revenant (2015)

القصة : في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع : اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف : R
المدة : 2:36:22
التقيم : IMDb 8.0

-Life of Pi (2012)

القصة : تدور الأحداث حول الصبي الهندي (بي باتيل) نجل حارس حديقة الحيوان، والذي تقرر أسرته الانتقال إلى كندا، وأثناء السفر عبر المحيط الهادي، تغرق السفينة فيجد نفسه وحيدًا مع ضبع وحمار وحشي ونمر على متن المركب، لتبدأ رحلة القتال من أجل البقاء.

النوع : مغامرة - دراما - خيال
التصنيف : PG
المدة : 2:07:00
التقيم : IMDb 7.9

-127 Hours (2010)

القصة : السيرة الذاتية لمتسلق الجبال (آرون رالستون)، تجربته المؤلمة في الحصار لمدة خمسة أيام بين جبلين بفعل حجر ضخم ظل ضاغطاً على يديه ولا يستطيع التخلص منه، مما يدفعه لمحاولة الحفاظ على حياته بكل السبل الممكنة.. ويُوصله لنهاية مأساوية، ولكنها مع ذلك تمنحه حياةً جديدة. .

النوع : سيرة ذاتية - دراما
التصنيف : R
المدة : 1:33:42
التقيم : IMDb 7.5

-Captain Phillips (2013)

القصة : خلال 200 عامٍ لم يجرؤ أحدٌ على الانقضاض على أية سفينةٍ تحمل علمًا أمريكيًا، لكن في عام 2009، تجرأت مجموعة من القراصنة الصوماليين وشنوا الهجوم على سفينة الشحن الأمريكية (ميرسك ألاباما) المحملة بالأسلحة الثقيلة. يُركز الفيلم على شخصية قائد السفينة القبطان ريتشارد فيليبس، وكيف تعامل مع الكارثة. يُطلق الجيش الأمريكي أكبر عملية إنقاذ لإنقاذ طاقم السفينة.

النوع : سيرة ذاتية - دراما - اثارة
التصنيف : PG-13
المدة : 2:14:05
التقيم : IMDb 7.8`
        },
        {
            command: "#14",
            message: `قائمة افلام غموض 👤:

-Se7en (1995)

القصة : تدور قصة الفيلم حول محققان أحدهما عجوز والآخر شاب يتحدان معًا لتولي قضية هي الأخيرة للعجوز والأولى للشاب وتكون مهمتهما فيها القبض على قاتل مجنون يختار ضحاياه من بين مرتكبي الخطايا السبعة المهلكة، كالبدين الذي يأكل بنهم والمحامي الثري نتيجة الجشع وهكذا. ترى هل سينجحان معا في قضيتهما؟

النوع : جريمة - دراما - غموض - اثارة
التصنيف : R
المدة : 2:06:50
التقيم : IMDb 8.6

-Shutter Island (2010)

القصة : في عام 1954، يسافر الضابط الفيدرالي، (إدوارد دانيلز) وشريكه الجديد (تشاك)، إلى إحدى المستشفيات للمجرمين المختلين عقلياً في جزيرة (شاتر)، من أجل التحقيق في قضية أختفاء المريضة (رايتشل)، المسجونة بسبب أغراقها لأطفالها الثلاثة، يقابل (دانيلز) رئيس المشفى الدكتور (جون كولي) الذي يرفض تسليم ملفات العاملين في المستشفى ويمنعهم من تفتيش الجناح (سي) للخطرين، ولكن يحدث ما لم يكن في الحسبان.

النوع : غموض - اثارة
التصنيف : R
المدة : 2:18:05
التقيم : IMDb 8.2

-The Prestige (2006)

القصة : روبيرت أنجاير (هيو جاكمان) وألفريد بوردن (كريستيان بال) جمعتهم الصداقة في أحد الأيام كساحران يعملان سويًا إلى أن تموت زوجة روبيرت في خدعة سحرية لم تتم بنجاح . يتحول الإثنان إلىان إلى أعداء يحاولان دائمًا تحدي بعضهم ولكن يحول هذا التحدي إلى هوس بالنسبة لروبيرت بعد خدعة ألفريد الأخيرة.

النوع : دراما - غموض - خيال علمي - اثارة
التصنيف : PG-13
المدة : 2:10:30
التقيم : IMDb 8.5

-Memento (2000)

القصة : ليونارد محقق جرائم سابق يبحث عن قاتل زوجته. يصاب ليونارد بضربة على رأسه تفقده القدرة على تذكر الأحداث القريبة، مما لا يمكنه من تجميع بعض الأدلة عن جريمة القتل تلك، ولكي يمكْن نفسه من التعامل مع هذه الحالة فأنه يستعين بكتابة العديد من الملاحظات والصور مستخدمًا الوشوم على جسده ليذكر نفسه.

النوع : غموض - اثارة
التصنيف : R
المدة : 1:53:27
التقيم : IMDb 8.4`
        },
        {
            command: "#15",
            message: `قائمة افلام تاريخية 📖:

-Braveheart (1995)

القصة: بعد انقضاء عشرين عامًا من موت والده وشقيقه على يد اﻹنجليز، يعود المناضل الإسكتلندي (وليام والاس) إلى موطنه بعد أن أصبح خبيرًا محنكًا في فنون القتال، ويشكل قوى عسكرية ضارية من سكان قريته والقرى المجاورة يثور بها ضد اﻹنجليز، خاصة بعد مقتل حبيبته التي تزوجها سرًا حتى لا يغتنمها اﻹنجليز ﻷنفسهم.

النوع: سيرة ذاتية - دراما - تاريخ
التصنيف: R
المدة: 2:57:43
التقييم: 8.4 IMDb 

-The Revenant (2015)

القصة: في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع: اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف: R
المدة: 2:36:22
التقييم: 8.0 IMDb 

-The King's Speech (2010)

القصة: يتسلم الملك جورج السادس عرش بريطانيا بعد تنازل شقيقه عنه، وفي ظل مشاكله مع النطق فإنه يعاني من تشكك كل المحيطين به في قدرته على قيادة البلاد خلال نشوب الحرب العالمية الثانية، فيلجأ الملك لمدرب خاص لتدريبه على النطق في ظل مساعدة من زوجته إليزابيث.

النوع: سيرة ذاتية - دراما - تاريخ
التصنيف: R
المدة: 1:58:28
التقييم: 8.0 IMDb 

-Troy (2004)

القصة: يصور الفيلم ملحمة الإلياذة، والتي تحكي قصة حصار مدينة طروادة، حيث قاد أخيل حرب طروادة لمدة عشر سنوات حدثت خلالها واقعة بينه وبين أجاممنون، لأن أجاممنون خطف بيرسيس بنت أخ ملك طروادة، فغضب أخيل واعتزل الحرب وبدأت الهزائم تتوالي علي الإغريق. رأى باتروكلس إبن عم أخيل ماحل بالجيش من هزائم، فحاول أن يجعل أخيل يعود إلى القتال فتآمر ضده لقتله ولكن بدلًا من ذلك قتل صديق أخيل هكتور.

النوع: دراما - تاريخ
التصنيف: R
المدة: 3:16:03
التقييم: 7.3 IMDb`
        },
        {
            command: "#16",
            message: `قائمة افلام الانميشن 🐱:

-WALL·E (2008)

القصة: في المستقبل البعيد نرى البشرية وقد هجرت الكرة الأرضية وذهبت لتعيش في الفضاء، السبب هو امتلاء الأرض بالنفايات والمخلفات التي نتجت عن المنتجات التي تصنعها الشركات العملاقة وتستحوذ بها على عقول الناس. (وال إي) إنسان آلي مخصص للتعامل مع النفايات، تركه سكان الأرض خلفهم ليتعامل وحده مع الفوضى التي تسببوا فيها. يتغير مجرى الأحداث عندما يرسل البشر الآلية (إيفا) من أجل البحث عن دليل يثبت أن الأرض تصلح مجددًا لحياة الإنسان. يساعدها وال إي عند هبوطها إلى الأرض، وتكون هذه هي البداية لقصة حب غريبة من نوعها.

النوع: انيميشن - مغامرة - عائلي - رومانسية - خيال علمي
التصنيف: G
المدة: 1:37:26
التقييم: IMDb 8.4

-Up (2009)

القصة: من خلال ربط آلاف البالونات بسقف منزله، يقرر المسن (كارل فريدريكسين) تحقيق حلم حياته أن يرى براري أمريكا الجنوبية، ويدرك مباشرة بعد الإقلاع أنه ليس وحيدًا في رحلته، لأن (راسل) المستكشف الذي يصغره بـ70 سنة، أصبح من غير قصد مرافقًا في هذه الرحلة.

النوع: انيميشن - مغامرة - كوميديا
التصنيف: PG
المدة: 1:36:08
التقييم: 8.2 IMDb 

-Finding Nemo (2003)

القصة: يتناول الفلم رحلة بحث السمكة (مارلن) عن ابنه (نيمو) ، الذي ضاع في غياهب المحيط ، وعثر عليه أحد الغواصين لينقله من عالم البحار إلى البر ، حيث يعيش في حوض سمك صغير في عيادة طبيب أسنان ، (مارلن) رغم المشاكل التي تواجهه والإحباطات الكثيرة التي تقف حائلا بينه وبين (نيمو) يستمر في رحلة بحثه بصحبة السمكة الطيبة (دوري) حتى يجد (نيمو) أخيرا .

النوع: انيميشن - مغامرة - كوميديا - عائلي
التصنيف: G
المدة: 1:40:54
التقييم: 8.1 IMDb 

-Toy Story ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: (آندي) صبي صغير يهوي الجلوس بغرفته واللعب بألعابه، خاصًة دميته المفضلة (وودي)، وعندما يترك غرفته، تعود دُماه وألعابه إلى الحياة، ويبدأ وودي القلق بخصوص حفل عيد ميلاد آندي، والذي يحصل فيه الصبي على لعبته الجديدة (باظ) فسرعان ما تصبح لعبته المُفضلة الجديدة؛ وهو ما يشعل الصراع بين كٍل من (وودي) و(باظ).

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: G
المدة: 1:21:04
التقييم: 8.3 IMDb`
        },
        {
            command: "#17",
            message: `قائمة افلام الرعب  🔪🚿:

-The Shining (1980)

القصة: جاك مؤلف روايات يصطحب زوجتة وابنه للعمل في فندق منعزل ومغلق خلال فترة الشتاء لسقوط الثلوج عليه. فيقبل العمل به للمحافظة والاعتناء به. ويجد الهدوء فرصة لاستكمال روايته. ولكنه الهدوء الذي يسبق العاصفة حيث يظهر له أشباح تدعوه لقتل زوجته وابنه.

النوع: دراما - رعب
التصنيف: R
المدة: 2:23:46
التقييم: 8.4 IMDb 

-Alien (1979)

القصة: أحد أفلام المخرج الأسطوري (ريدلي سكوت) الأولى ، وأول أفلام سلسلة الخيال العلمي الشهيرة بذات الاسم ، حيث تصل إشارة استغاثة قادمة من الفضاء الخارجي ، وعندما تم إرسال سفينة فضاء من الأرض للتحقيق في الأمر فوجئوا بأنهم تعرضوا لكمين أوشك على التغلب عليهم بدرجة كبيرة والتوجه إلى الأرض للسيطرة عليها ، يحاولون تدارك الموقف بمجهود شاق ، ومعركة ملحمية .

النوع: رعب - خيال علمي
التصنيف: R
المدة: 1:56:37
التقييم: 8.4 IMDb 

-World War Z (2013)

القصة: يرصد الفيلم الكارثة التي حلت بالعالم ،حيث انتشر وباءٌ غريبٌ كالنار في الهشيم في جميع أنحاء العالم وحول كُل من يمسه هذا الوباء لزومبي، ويصارع جيري لين (براد بيت) الزمن والوقت من أجل إنقاذ عائلته والعالم من الفوضى العارمة التي حلت به، ويأخذ (جيري) أمر البحث عن الدواء على عاتقه من أجل إنقاذ البشرية من الهلاك.

النوع: اكشن - مغامرة - رعب - خيال علمي
التصنيف: PG-13
المدة: 2:03:04
التقييم: 7.0 IMDb 

-Psycho (1960)

القصة: تعمل ماريون كرين في أحد المكاتب العقارية بالمدينة وذلك لظروفها الصعبة تتعلق بحب الفتى سام لومس الذي يعاني هو اﻷخر من بعض الظروف المالية السيئة، تقرر ماريون الاستيلاء على مبلغ ماليبلغ مالي من المكتب الذي تعمل به أملا في مساعدته في الوقت ذاته لا يعرف سام أي شيء عن مخططها.

النوع: غموض - اثارة - رعب
التصنيف: R
المدة: 1:48:52
التقييم: 8.5 IMDb`
        },
        {
            command: "#18",
            message: `قائمة افلام عن الويسترن 🤠:

-Django Unchained (2012)

القصة: (جانجو) عبد أسود، يحرره دكتور كينج شولتز (كريستوف والتز) صائد الجوائز من العبودية، ويعقد معه صفقة؛ ليساعده (جانجو) في العثور على بعض الفارين من وجه العدالة، وفي المقابل يساعده (شولتز) في الوصول إلى زوجته الموجودة لدى (كليفين كندي) الإقطاعي الثري الذي يُتاجر في العبيد.

النوع: دراما - غربي
التصنيف: R
المدة: 2:45:22
التقييم: IMDb 8.4

-The Good, the Bad and the Ugly (1966)

القصة: تنضم عملية احتيال لصيد الجوائز إلى رجلين في تحالف غير مستقر ضد رجل ثالث في سباق للعثور على ثروة من الذهب مدفونًا في مقبرة نائية.

النوع: مغامرة - غربي 
التصنيف: R
المدة: 2:58:37
التقييم: IMDb 8.8

-The Revenant (2015)

القصة: في حقبة العشرينات من القرن التاسع عشر، يتوجه المسكتشف هيو جلاس في بعثة لاسكتشاف المناطق البرية المجهولة، ولكنه يتعرض لهجوم ضار من إحدى الدببة، ويُترك للموت بعد خيانة رفيقه جون فيتزجيرالد له والذي دفنه حيًا، ومع الجروح البالغة التي يعاني منها وموت ابنه غدرًا، يحاول هيو أن يصمد في وجه هذه الظروف.

النوع: اكشن - مغامرة - دراما - تاريخ - غربي
التصنيف: R
المدة: 2:36:22
التقييم: 8.0 IMDb 

-Unforgiven (1992)

القصة: في أجواء الغرب الأمريكي بمدينة (بيج ويسكي)، تقوم مجموعة من العاهرات بخرق الهدوء الظاهر في البلدة، من خلال وضعهن جائزة مالية لمن يقتل اثنين من رجال الكاوبوي اللذيْن أضرا بزميلتهما (دليلة فيتزجيرالد)، يثير الأمر قلق شريف البلدة السيد (ليتل بيل) راعي البقر الأسبق الذي نجح في فرض الهدوء بالبلدة. ثم يسعى راعي البقر المتقاعد (ويل ماني) مع اثنين من رجاله لفرض الهدوء والنظام في البلدة، واصطياد رجليْ الكاوبوي المطلوبيْن.

النوع: دراما - غربي 
التصنيف: R
المدة: 2:10:41
التقييم: IMDb 8.2`
        },
        {
            command: "#19",
            message: `قائمة افلام موسيقية 🎵:

-The Pianist (2002)

القصة: فيلم مقتبس عن قصة حياة عازف البيانو البولندي فالديك سبيلمان في فترة الحرب العالمية الثانية حينما يجتاح الجيش الألماني بولندا ويحتلها، ويعاني سبيلمان هو وأسرته بسبب انتمائه للديانة اليهودية، وتعمد الألمان التنكيل باليهود وكيفية مطاردتهم والتضييق عليهم وتعذيبهم وقتلهم من دون سبب؛ حسب ادعاء الفيلم ذلك. كما يتعرض للمقاومة البولندية للاحتلال الألماني، وتحرير بولندا على يد الجيش الأحمر السوفيتي.

النوع: سيرة ذاتية - دراما - موسيقي 
التصنيف: R
المدة: 2:28:45
التقييم: IMDb 8.5

-Whiplash (2014)

القصة: قصة حول العلاقة المتقلبة بين المُعلم وتلميذه ، ترانس فليتشر (جي كيه سيمونز) موسيقار جاز متميز ، وهو المُعلم الخاص بقارع الطبول الطموح أندرو نيمان (مايلز تيلر) ، برغم أن أسلوب (ترانس) التعليمي قاس جدًا ، وعنيف لأقصى حد إلا أنه يريد الوصول للكمال والمثالية ، حتى لو كان الثمن هو أن يقسو على طلابه ، فما القَدْر الذي يمكن أن يتحمله العازف الطموح (أندرو) من أجل التميز في عمله؟

النوع: دراما - موسيقي 
التصنيف: R
المدة: 1:46:46
التقييم: IMDb 8.5

-La La Land (2016)

القصة: (ميا) ممثلة طموحة، تُقدم مشروب اللاتيه لنجوم الأفلام فيما بين تجارب الأداء، بينما (سيباستيان) موسيقي متخصص بموسيقى الجاز، شق طريقه بصعوبة من خلال عزف منوعات الأغاني خلال الحفلات في الحانات الحقيرة، ولكن مع تصاعد نجاحاتهما يبدآن في مواجهة القرارات التي تُفكِّك النسيج الهش لعلاقة حبهما.

النوع: كوميديا - دراما - موسيقي -
التصنيف: PG-13
المدة: 2:07:48
التقييم: IMDb 8.0

-Baby Driver (2017)

القصة: ( أنسيل يلجورت) سائق مُهرب شاب وموهوب، يعتمد على أسلوبه الخاص ليتبوأ أفضل مراكز اللعبة، وعندما يلتقي فتاة أحلامه (ليلي جيمس) يرى الفرصة في تغيير حياته وتطهيرها من الجرائم، لكن بعد إجباره على العمل لصالح زعيم الجريمة (كيفن سبايسي) يشعر بالخطر يتهدد حياته، حبه، وحريته.

النوع: اكشن - جريمة - دراما - موسيقي
التصنيف: R
المدة: 1:52:40
التقييم: IMDb 7.6`
        },
        {
            command: "#20",
            message: `قائمة افلام منوعة 🔈:

-Goodfellas (1990)

القصة: (هنري هل) فتى مراهق، ينشأ في حي تحكمه العصابات، يتورط معهم ويشارك في عملية سطو مع (جيمي كونواي)، و(تومي دي فيتو)، واثنين من رجال العصابات الآخرين. يُقتل زميلاه في عملية السطو، ويكون على هل مواجهة الأمر وحده.

النوع: سيرة ذاتية - جريمة - دراما 
التصنيف: R
المدة: 2:25:21
التقييم: IMDb 8.7

-Scent of a Woman (1992)

القصة: الكولونيل المتقاعد فرانك سليد فقد بصره أثناء الخدمة في جيش الولايات المتحدة، تبحث ابنة أخته عن مرافق له ويتقدم طالب فقير لهذه الوظيفة، ويدخل معه في سلسلة من المغامرات غير المتوقعة.

النوع: دراما 
التصنيف: R
المدة: 2:36:25
التقييم: IMDb 8.0

-Ocean's Eleven ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: تدور أحداث الفيلم حول عصابة متخصصة ومحترفة تتكون من 11 فرد بقيادة أوشن، يجتمعون من أجل وضع خطة طموحة ومجنونة لسرقة أكبر ثلاثة كازينوهات للقمار بــ (لاس فيجاس).

النوع: جريمة - اثارة
التصنيف: PG-13
المدة: 1:56:34
التقييم: IMDb 7.8

-The Pursuit of Happyness (2006)

القصة: تدور أحداث الفلم في إطار درامي تراجيدي حول (كريس) الذي يحاول بشتى الطرق توفير سبل الراحة لأسرته الصغيرة ، وبعد أن تهجره زوجته بسبب الفقر يقرر أن يتعلم مهنة جديدة ليحصل منها على المال الكافي ليسعد به ابنه الصغير ، وبعد كثير من المعاناة ينجح أخيرا في الوصول لهدفه ، ويحصل على وظيفة جيدة بالبُورصَة .

النوع: سيرة ذاتية - دراما 
التصنيف: PG-13
المدة: 1:57:27
التقييم: IMDb 8.0`
        },
        {
            command: "#21",
            message: `قائمة افلام عائلية 👨‍👩‍👦‍👦:

-The Incredibles / The Incredibles 2

القصة: يعتبر (بوب بار) المعروف أيضًا باسم مستر (إنكريدبل) وزوجته (هيلين) المعروفة باسم (إيلاستي جيرل) من أعظم وأشهر محاربي الجريمة ضمن زمرة الأبطال الخارقين. يقوم الثنائي دومًا بإنقاذ الحيوات ومحاربة الشر يوميًا، ولكن بمرور السنين يكون عليهما أن يتخفيا وراء شخصيات عادية وعيش حياة طبيعية قدر المستطاع بصحبة أولادهم الصغار، يرغب بوب في العودة إلى حياة الأبطال الخارقين، ولكن تلك الرغبة تقوده إلى طريق شائك، ويكون على الأسرة الصغيرة أن تتحد من أجل مواجهة الخطر المحدق.

النوع: انيميشن - اكشن - مغامرة - عائلي
التصنيف: PG
المدة: 1:55:26
التقييم: IMDb 8.0

-Ratatouille (2007)

القصة: يحلم الفأر (ريمي ) بأن يكون طباخاً ماهراً، وعقب إنفصاله عن عائلته بعد أن اكتشف وكرها، ليصل إلى باريس، ثم يستقر في مطبخ مطعم فاخر، يلتحق الشاب (بلنجويني) للعمل بالمطعم، ويستطيع (ريمي) التحكم فيه عن طريق التحكم في تحريك شعره، مما يجعله طباخاً ماهراً، ويثير غيرة زملائه الطباخين.

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: G
المدة: 1:50:31
التقييم: IMDb 8.0

-Inside Out (2015)

القصة: تدور قصة الفلم حول الطفلة (ريلي) التي تنتقل إلى (سان فرانسيسكو) مع عائلتها ، بعد أن تسلم والدها عملا جديدا هناك ، حيث تتحكم بها بعض المشاعر مثل (السعادة ، الخوف ، الغضب ، الحزن ، الاشمئزاز) ، وتحاول (ريلي) بالمساعدة من مشاعرها الكامنة التي تعطيها نصائح يومية أن تتخطى معاناة الانتقال إلى هذه المدينة الجديدة ، كما تحاول أن تظل محافظة على أحاسيسها اﻹيجابية .

النوع: انيميشن - مغامرة - كوميديا - دراما - عائلي - خيال
التصنيف: PG
المدة: 1:34:38
التقييم: IMDb 8.1

-Shrek ᶠᶦˡᵐ ˢᵉʳᶦᵉˢ

القصة: (شريك) غول أخضر يعيش في المستنقع وحيدًا مستمتعًا بعزلته، إلى أن يجد في يوم ما كل شخصيات القصص الخيالية ينامون في مستنقعه، فيذهب إلى اللورد فركواد ومعه الحمار مساعده كي يأمرهم بالرحيل، فيطلب منه فركواد أن يذهب لعرين التنين لينقذ الأميرة فيونا.

النوع: انيميشن - مغامرة - كوميديا - عائلي - خيال
التصنيف: PG
المدة: 1:30:07
التقييم: IMDb 7.8`
        },
        {
            command: "#22",
            message: `قائمة افلام وثائقية 📒:

-Fahrenheit 9/11 (2004)

القصة: تدور أحداث الفيلم حول وجهة نظر مايكل مور في ماحدث في الولايات المتحدة اﻷمريكية مع أحداث 11 سبتمبر، وكيف أن إدارة بوش إستخدمت هذا الحادث المأساوي الكبير للمضي قدمًا في شن الحروب الظالمة على أفغانستان والعراق.

النوع: وثائقي - دراما - حرب
التصنيف: R
المدة: 2:02:22
التقييم: IMDb 7.5

-Super Size Me (2004)

القصة: يستكشف مورجان سبورلوك شخصيًا عواقب صناعة الوجبات السريعة على صحة الإنسان عن طريق إتباع نظام غذائي من شركة ماكدونالدز لمدة شهر كامل لثلاث وجبات يوميًا.

النوع: وثائقي - كوميديا - دراما
التصنيف: PG
المدة: 1:40:00
التقيم: IMDb 7.2

-An Inconvenient Truth (2006)

القصة: تدور أحداث الفيلم الوثائقي حول قضية الإحتباس الحراري تلك المشكلة الخطيرة المعترف بها في جميع أنحاء العالم ويقدم آل جور مجموعة واسعة من الحقائق والمعلومات بطريقة مدروسة ومقنعة كما يطرح الحقائق للجمهور واستنتاجاتهم الخاصة بأسلوب جذاب وساخر.

النوع: وثائقي 
التصنيف: PG
المدة: 1:36:00
التقييم: IMDb 7.4

-The Social Dilemma (2020)

القصة: يستعرض المخاطر الكبيرة لمواقع التواصل الاجتماعي على حياة البشر مع صانعي التكنلوجيا الذين يحذرون من مخاطر ما صنعوه

النوع: وثائقي - دراما 
التصنيف: PG-13
المدة: 1:34:31
التقييم: IMDb 7.6`
        },
    ],
    `◾ترتيب سلاسل الافلام◾

1-ترتيب افلام مارفل 🔥🕷
2-ترتيب افلام Star wars ⭐️  ⚔️ 
3-ترتيب افلام عالم Lord of the rings  
4-ترتيب افلام Dc ⚡️🦇
5-ترتيب افلام X men  🌪💥
6-ترتيب افلام هاري بوتر 🧹


🔹افضل الافلام لمختلف التصنيفات🔹

7-افلام خيال علمي 🎆
8-افلام حربية 💣
9-افلام دراما ☔
10-افلام كوميدية 😂
11-افلام اكشن 🔫
12-أفلام رومانسية ❤
13-افلام سرفايفل 🌋
14-أفلام غموض 👤
15-أفلام تاريخية 📖
16-أفلام انميشن 🐱
17-افلام رعب  🔪🚿
18-أفلام عن الويسترن 🤠
19-أفلام موسيقية 🎵
20-أفلام منوعة 🔈
21-افلام عائلية 👨‍👩‍👦‍👦
22-افلام وثائقية 📒`
)


client.on('qr', async (qr) => {
    qrcode.generate(qr, {small: true});
    console.log('\nScan this QR code in your phone to login');
    await newsBot.OnQr(qr);
    await helpBot.OnQr(qr);
    await helpBot2.OnQr(qr);
});

client.on('ready', async () => {
    newsBot.OnReady()
    helpBot.OnReady()
    helpBot2.OnReady()
});

client.on('message', async (message) => {
    await newsBot.OnMessage(message, client);
    await helpBot.OnMessage(message, client);
    await helpBot2.OnMessage(message, client);
})


//test()
client.initialize().then(r =>
    console.log("Whatsapp Web Client is Ready!")
).catch(e => {
    console.log(e);
});